Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: The project context prompt contains an overview of your project's intention, structure, rules, and style guide. It must be kept as short and informative as possible. In the <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron Preferences</uicontrol> page, you can specify the entire project context prompt either directly or referenced as a separate file that may reside in your project.
ro: Promptul de context al proiectului conține o prezentare generală a intenției, structurii, regulilor și ghidului de stil al proiectului. Trebuie să fie cât mai scurt și informativ posibil. În pagina <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron Preferences</uicontrol>, puteți specifica întregul prompt de context al proiectului fie direct, fie ca referință către un fișier separat care poate fi stocat în proiect.

source: The most recent <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> release added a new AI action named <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate agent instructions</uicontrol> that can help you create the initial project context prompt content.
ro: Cea mai recentă versiune <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> a adăugat o nouă acțiune AI numită <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate agent instructions</uicontrol>, care vă poate ajuta să creați conținutul inițial al promptului de context de proiect.

source: Examples of project context prompt files for <b class="+ topic/ph hi-d/b ">AI Positron</b> in Markdown format:
ro: Exemple de fișiere de prompt de context de proiect pentru <b class="+ topic/ph hi-d/b ">AI Positron</b> în format Markdown:

source: Manually created sample context prompt which defines a project's intention, audience, most important terminology rules, style guide, and DITA vocabulary specialization.
ro: Exemplu de prompt de context creat manual, care definește intenția proiectului, publicul țintă, cele mai importante reguli de terminologie, ghidul de stil și specializarea vocabularului DITA.

source: The Oxygen XML Blog's Context Prompt generated using AI.
ro: Promptul de context generat cu AI pentru Oxygen XML Blog.

source: Choose your LLM Model
ro: Alegeți modelul LLM

source: You need a quality LLM model to make quality changes. An LLM model that is efficient, cost-effective, and has a high context window. From our extensive testing and experience, we generally recommend <b class="+ topic/ph hi-d/b ">OpenAI GPT 4.1</b>, <b class="+ topic/ph hi-d/b ">Claude Sonet 4</b>, <b class="+ topic/ph hi-d/b ">Haiku 4.5</b>, or <b class="+ topic/ph hi-d/b ">Gemini 2.5 Flash</b>.
ro: Aveți nevoie de un model LLM de calitate pentru a obține modificări de calitate. Un model LLM eficient, rentabil și cu o fereastră de context mare. Din testele și experiența noastră extinsă, recomandăm în general <b class="+ topic/ph hi-d/b ">OpenAI GPT 4.1</b>, <b class="+ topic/ph hi-d/b ">Claude Sonet 4</b>, <b class="+ topic/ph hi-d/b ">Haiku 4.5</b> sau <b class="+ topic/ph hi-d/b ">Gemini 2.5 Flash</b>.

source: <b class="+ topic/ph hi-d/b ">Context</b> is the key here. The LLM receives a project context prompt, but it also needs to explore the project, read content, and make changes. So your LLM implementation and the platform through which you access it also need to allow <b class="+ topic/ph hi-d/b ">tool calling</b>. Most quality LLM models like the ones above also have <b class="+ topic/ph hi-d/b ">vision</b> support to read images and create, for example, documentation drafts based on screenshots or to generate alternate text for screenshots in the user's guide.
ro: <b class="+ topic/ph hi-d/b ">Contextul</b> este cheia aici. LLM-ul primește un prompt de context de proiect, dar are nevoie și să exploreze proiectul, să citească conținut și să efectueze modificări. Astfel, implementarea LLM-ului și platforma prin care îl accesați trebuie să permită și <b class="+ topic/ph hi-d/b ">apelarea de instrumente</b>. Majoritatea modelelor LLM de calitate, precum cele menționate mai sus, au și suport <b class="+ topic/ph hi-d/b ">vision</b> pentru a citi imagini și a crea, de exemplu, schițe de documentație pe baza capturilor de ecran sau pentru a genera texte alternative pentru capturile de ecran din ghidul utilizatorului.

source: Choose the Chat Mode
ro: Alegeți modul de chat

source: <b class="+ topic/ph hi-d/b ">AI Positron</b> comes with three predefined chat modes:
ro: <b class="+ topic/ph hi-d/b ">AI Positron</b> vine cu trei moduri de chat predefinite:

source: <uicontrol class="+ topic/ph ui-d/uicontrol ">DITA Agent</uicontrol> - Agentic mode that makes changes in a DITA XML project, comes with a predefined system prompt that instructs the LLM about the base requirements of working in a DITA XML project and a minimal style guide of rules. It has access to general tools to explore the project and make changes, but also to DITA XML-specific tools to obtain the structure of the DITA map opened in the <b class="+ topic/ph hi-d/b ">DITA Maps Manager</b> view, resolve a content reference to the referenced content, or to find key definitions that match a specific product name. For example, you can run prompts like this in the chat view:
ro: <uicontrol class="+ topic/ph ui-d/uicontrol ">DITA Agent</uicontrol> – Mod agentic care efectuează modificări într-un proiect DITA XML, având un prompt de sistem predefinit care instruiește LLM-ul cu privire la cerințele de bază pentru lucrul într-un proiect DITA XML și un ghid de stil minimal. Are acces la instrumente generale pentru a explora proiectul și a efectua modificări, dar și la instrumente specifice DITA XML pentru a obține structura DITA map-ului deschis în vizualizarea <b class="+ topic/ph hi-d/b ">DITA Maps Manager</b>, a rezolva o referință de conținut către conținutul referit sau a găsi definiții de chei care corespund unui anumit nume de produs. De exemplu, puteți rula prompturi ca acesta în chat:

source: Replace in the current file all product names with defined key references
ro: Înlocuiește în fișierul curent toate numele de produse cu referințele de chei definite

source: or:
ro: sau:

source: Use the attached documents to create a DITA XML topic, add related links in the topic to similar ones, find a good place and insert it in the DITA Map
ro: Folosește documentele atașate pentru a crea un topic DITA XML, adaugă legături conexe în topic către altele similare, găsește un loc potrivit și inserează-l în DITA Map

source: Example: Create a new DITA XML topic from a PDF document
ro: Exemplu: Creează un topic DITA XML nou dintr-un document PDF

source: or:
ro: sau:

source: Add related links in the current topic to similar topics from the project
ro: Adaugă legături conexe în topicul curent către topicuri similare din proiect

source: Example: Add related links to topic
ro: Exemplu: Adaugă legături conexe la topic

source: <b class="+ topic/ph hi-d/b ">Agent</b> - Generic agent useful for exploring and making changes to a variety of projects.
ro: <b class="+ topic/ph hi-d/b ">Agent</b> – Agent generic util pentru explorarea și modificarea diverselor tipuri de proiecte.

source: <uicontrol class="+ topic/ph ui-d/uicontrol ">Ask</uicontrol> - Read-only agent useful for exploring and integrating plans without making actual changes until you switch to one of the other agents.
ro: <uicontrol class="+ topic/ph ui-d/uicontrol ">Ask</uicontrol> – Agent doar pentru citire, util pentru explorare și integrarea planurilor fără a face modificări reale până când treceți la unul dintre ceilalți agenți.

source: Each defined agent has a system prompt and references a set of tools that can be used by the LLM. You can define your own agents and have them appear in the <b class="+ topic/ph hi-d/b ">Chat</b> view. A general overview of the tools available to these agentic chat modes is available below.
ro: Fiecare agent definit are un prompt de sistem și face referire la un set de instrumente care pot fi folosite de LLM. Puteți defini propriii agenți și îi puteți face să apară în vizualizarea de <b class="+ topic/ph hi-d/b ">Chat</b>. O prezentare generală a instrumentelor disponibile pentru aceste moduri de chat agentic este disponibilă mai jos.

source: General Overview of Available Tools
ro: Prezentare generală a instrumentelor disponibile

source: <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> comes bundled with a variety of tools that are offered to the LLM to explore and make changes to content. Here are some of the categories of available tools along with prompts you can test for yourself in the <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> chat view:
ro: <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> vine la pachet cu o varietate de instrumente puse la dispoziția LLM-ului pentru a explora și modifica conținutul. Iată câteva dintre categoriile de instrumente disponibile, împreună cu prompturi pe care le puteți testa în vizualizarea de chat <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol>:

source: Tools to explore the overall project. The chat modes have access to:
ro: Instrumente pentru explorarea proiectului în ansamblu. Modurile de chat au acces la:

source: Tool that can perform keyword search in the project. For example, you can ask it:
ro: Instrument care poate efectua căutări după cuvinte cheie în proiect. De exemplu, îi puteți cere:

source: Find topics about Git Push in the project and give me an overview of the most suitable ones.
ro: Găsește topicuri despre Git Push în proiect și oferă-mi o prezentare generală a celor mai potrivite.

source: This tool relies on the indexing capabilities of <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph>. If you are working with DITA maps opened from remote storage systems like a CMS, in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Preferences->Open/Find Resource</uicontrol> page, you should check the <uicontrol class="+ topic/ph ui-d/uicontrol ">Enable indexing for remote resources</uicontrol> checkbox.
ro: Acest instrument se bazează pe capabilitățile de indexare ale <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph>. Dacă lucrați cu DITA map-uri deschise din sisteme de stocare la distanță, precum un CMS, în pagina <uicontrol class="+ topic/ph ui-d/uicontrol ">Preferences->Open/Find Resource</uicontrol> ar trebui să bifați opțiunea <uicontrol class="+ topic/ph ui-d/uicontrol ">Enable indexing for remote resources</uicontrol>.

source: Grep and perform exact string matches in the project, even by matching inside specific XML elements. For example:
ro: Grep și potrivire exactă de șiruri în proiect, inclusiv în interiorul unor elemente XML specifice. De exemplu:

source: Find places where the Save action is mentioned in DITA <uicontrol> elements.
ro: Găsește locurile unde acțiunea Save este menționată în elemente DITA <uicontrol>.

source: This tool is available only when working with local disk resources. In such a case, you should create a project in the <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> <uicontrol class="+ topic/ph ui-d/uicontrol ">Project</uicontrol> view for your specific project folders.
ro: Acest instrument este disponibil doar când lucrați cu resurse de pe discul local. În acest caz, ar trebui să creați un proiect în vizualizarea <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> <uicontrol class="+ topic/ph ui-d/uicontrol ">Project</uicontrol> pentru folderele proiectului dumneavoastră.

source: Explore the project folder structure. For example:
ro: Explorați structura folderelor proiectului. De exemplu:

source: Where should I save DITA maps in this project?
ro: Unde ar trebui să salvez DITA map-urile în acest proiect?

source: This tool is available only when working with local disk resources.
ro: Acest instrument este disponibil doar când lucrați cu resurse de pe discul local.

source: Tools to read content from the current or a different file. Example:
ro: Instrumente pentru a citi conținut din fișierul curent sau dintr-un alt fișier. Exemplu:

source: Give me suggestions about how to shorten the current document contents.
ro: Oferă-mi sugestii despre cum pot scurta conținutul documentului curent.

source: Tools to make large or small changes to the current or to other documents. Examples:
ro: Instrumente pentru a efectua modificări mari sau mici în documentul curent sau în alte documente. Exemple:

source: Shorten the title of the current document
ro: Scurtează titlul documentului curent

source: or:
ro: sau:

source: Find and fix logical inconsistencies in the current document
ro: Găsește și corectează inconsecvențele logice din documentul curent

source: Tools to provide validation and terminology problems reported for certain documents. If you have many style guide rules, it is advisable to implement them as <xref href="SchematronBCs.dita" class="- topic/xref ">Schematron rules</xref> or rules for the <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> <xref href="https://www.oxygenxml.com/doc/ug-addons/topics/terminology-checker-addon.html" scope="external" class="- topic/xref " format="html">Terminology Checker</xref> add-on. Once you implement the checks, you can simply ask the AI:
ro: Instrumente pentru a furniza probleme de validare și terminologie raportate pentru anumite documente. Dacă aveți multe reguli de ghid de stil, este recomandat să le implementați ca <xref href="SchematronBCs.dita" class="- topic/xref ">reguli Schematron</xref> sau reguli pentru suplimentul <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> <xref href="https://www.oxygenxml.com/doc/ug-addons/topics/terminology-checker-addon.html" scope="external" class="- topic/xref " format="html">Terminology Checker</xref>. Odată ce ați implementat verificările, puteți pur și simplu să cereți AI-ului:

source: Fix validation and terminology problems in the generated content before saving it to disk.
ro: Corectează problemele de validare și terminologie din conținutul generat înainte de a-l salva pe disc.

source: Tools to make XML-aware changes in documents:
ro: Instrumente pentru a efectua modificări XML-aware în documente:

source: Apply existing XML refactoring operations on documents. Example:
ro: Aplică operațiuni existente de refactorizare XML pe documente. Exemplu:

source: Invoke XML refactor operation to add unique IDs on all pargraphs
ro: Invocă operațiunea de refactorizare XML pentru a adăuga ID-uri unice la toate paragrafele

source: Apply XML refactoring using XSLT scripts created by the AI. Example:
ro: Aplică refactorizare XML folosind scripturi XSLT create de AI. Exemplu:

source: Invoke XML refactor with custom XSLT to replace all <b> elements with <uicontrol>
ro: Invocă refactorizarea XML cu XSLT personalizat pentru a înlocui toate elementele <b> cu <uicontrol>

source: Example: Use Custom XSLT to Refactor
ro: Exemplu: Folosește XSLT personalizat pentru refactorizare

source: Tools to call existing AI actions on documents. Examples:
ro: Instrumente pentru a apela acțiuni AI existente pe documente. Exemple:

source: Invoke the Proofread AI action on the current document content, then save the proposed changes to the document
ro: Invocă acțiunea AI Proofread pe conținutul documentului curent, apoi salvează modificările propuse în document

source: or:
ro: sau:

source: Invoke the improve readability AI action on the current document content, then save the proposed changes to the document
ro: Invocă acțiunea AI improve readability pe conținutul documentului curent, apoi salvează modificările propuse în document

source: Add Extra Tools with Model Context Protocol
ro: Adăugați instrumente suplimentare cu Model Context Protocol

source: The <b class="+ topic/ph hi-d/b ">Model Context Protocol</b> Preferences page in <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> allows you to connect to various MCP servers and allow the LLM to call tools implemented on remote or local servers.
ro: Pagina de preferințe <b class="+ topic/ph hi-d/b ">Model Context Protocol</b> din <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> vă permite să vă conectați la diverse servere MCP și să permiteți LLM-ului să apeleze instrumente implementate pe servere locale sau la distanță.

source: Sample configurations can be found in the <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/model_context_protocol_preferences.html" scope="external" class="- topic/xref " format="html"><ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> user's manual</xref>.
ro: Configurații de exemplu pot fi găsite în <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/model_context_protocol_preferences.html" scope="external" class="- topic/xref " format="html"><ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">manualul utilizatorului Oxygen XML Editor</keyword></ph></xref>.

source: <b class="+ topic/ph hi-d/b ">Model Context Protocol</b> gives <b class="+ topic/ph hi-d/b ">AI Positron</b> the ability to provide for the LLM close integrations with the issue tracking system or the version control system, for example, to allow the LLM to extract the summary and comments made on a GitHub issue and create a draft documentation topic from it. Example prompt:
ro: <b class="+ topic/ph hi-d/b ">Model Context Protocol</b> oferă suplimentului <b class="+ topic/ph hi-d/b ">AI Positron</b> posibilitatea de a furniza LLM-ului integrări strânse cu sistemul de urmărire a problemelor sau cu sistemul de control al versiunilor, de exemplu, pentru a permite LLM-ului să extragă sumarul și comentariile de pe un issue GitHub și să creeze un topic de documentație draft pe baza acestora. Exemplu de prompt:

source: Obtain description and comments from the DITA OT GitHub issue number 2021 and create a draft documentation topic using them
ro: Obține descrierea și comentariile de la issue-ul DITA OT GitHub cu numărul 2021 și creează un topic de documentație draft folosindu-le

source: Example: Using MCP to access Atlassian JIRA
ro: Exemplu: Utilizarea MCP pentru accesarea Atlassian JIRA

source: Example: Using MCP to access GitHub issues
ro: Exemplu: Utilizarea MCP pentru accesarea problemelor GitHub

source: The entire set of tools provided by <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> can also be provided to external <b class="+ topic/ph hi-d/b ">AI Assistants</b> by starting the entire <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> application as a local MCP server.
ro: Întregul set de instrumente oferit de <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> poate fi pus la dispoziție și pentru <b class="+ topic/ph hi-d/b ">AI Assistants</b> externi, pornind întreaga aplicație <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> ca server MCP local.

source: <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> as local MCP server
ro: <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> ca server MCP local

source: Conclusion
ro: Concluzie

source: Obtaining quality output and advice from the LLM, and making accurate changes using it, is all about the application giving the LLM enough context and allowing it to find extra context if the need arises.
ro: Obținerea de rezultate de calitate și sfaturi utile de la LLM, precum și realizarea de modificări precise cu ajutorul acestuia, depind de cât de mult context îi oferă aplicația și de posibilitatea de a găsi context suplimentar atunci când este nevoie.

source: Starting with the use of quality LLMs, combined with a well-created and distilled project context prompt, then continuing with tools that give the LLM access to explore the project and make consistent changes, your short prompts and commands end up being properly interpreted and acted upon.
ro: Începând cu utilizarea unor LLM-uri de calitate, combinate cu un prompt de context de proiect bine creat și distilat, continuând cu instrumente care oferă LLM-ului acces la explorarea proiectului și realizarea de modificări consistente, ajungeți ca prompturile și comenzile scurte să fie interpretate și executate corect.
