Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: Blog Classification
ro: Clasificarea blogului

source: Blog Classification Subject Scheme Definition
ro: Definiția schemei de clasificare a subiectelor blogului

source: Learning
ro: Resurse de învățare

source: Publishing Customizations
ro: Personalizări pentru publicare

source: Editing Customizations
ro: Personalizări pentru editare

source: Migrate
ro: Migrare

source: Plugins/Frameworks SDK
ro: SDK pentru pluginuri/framework-uri

source: Key definitions
ro: Definiții cheie

source: <topichead navtitle="Artificial intelligence (AI)" class="+ map/topicref mapgroup-d/topichead ">
ro: <topichead navtitle="Inteligență artificială (AI)" class="+ map/topicref mapgroup-d/topichead ">

source: Graph Visualization of the Oxygen XML Blog DITA Map
ro: Vizualizare grafică a DITA Map-ului Oxygen XML Blog

source: AI Positron Add-on Functionality - Small Clips
ro: Funcționalități ale suplimentului AI Positron - Clipuri scurte

source: A list of small animated clips showcasing some interesting aspects of the functionality.
ro: O listă de clipuri animate scurte care prezintă câteva aspecte interesante ale funcționalității.

source: Generat a draft DITA XML topic from an image
ro: Generează un topic DITA XML de tip draft pornind de la o imagine

source: Batch generating alternate text for DITA XML images
ro: Generare în lot a textului alternativ pentru imaginile DITA XML

source: Generate a Mermaid diagram from a task
ro: Generează o diagramă Mermaid dintr-o sarcină

source: Add comments about grammar problems and then resolve them
ro: Adaugă comentarii despre probleme gramaticale și apoi rezolvă-le

source: Proof Read and Resolve Comments
ro: Corectare și rezolvare comentarii

source: Add Structured Content - Project based Retrieval Augmentation (RAG)
ro: Adaugă conținut structurat - Recuperare augmentată pe bază de proiect (RAG)

source: Improve Structure
ro: Îmbunătățește structura

source: AI Positron Assistant - Retrospective Analysis
ro: AI Positron Assistant - Analiză retrospectivă

source: It's been more than one year since we started working on the Oxygen AI Positron Add-on, back when the <uicontrol class="+ topic/ph ui-d/uicontrol ">OpenAI GPT 3.5</uicontrol> AI engine was released, and we are currently on version 4.0.0 of the add-on. Our main direction (which we still keep) was to provide powerful tools based on AI engines for technical documentation writers (targeted mostly towards DITA XML users) and for our XSLT/Schematron developers. I've always envisioned the AI set of tools as an exoskeleton, as a way to add more power to a technical documentation writer's punch throughout the day. The table below contains a list of concepts (mostly add-on specific features or feature categories), each with a short description based on personal experience.
ro: A trecut mai mult de un an de când am început să lucrăm la Oxygen AI Positron Add-on, pe vremea când motorul AI <uicontrol class="+ topic/ph ui-d/uicontrol ">OpenAI GPT 3.5</uicontrol> a fost lansat, iar în prezent suntem la versiunea 4.0.0 a suplimentului. Direcția noastră principală (pe care o menținem) a fost să oferim instrumente puternice bazate pe motoare AI pentru creatorii de documentație tehnică (în special pentru utilizatorii DITA XML) și pentru dezvoltatorii noștri XSLT/Schematron. Am văzut întotdeauna setul de instrumente AI ca pe un exoschelet, ca pe o modalitate de a adăuga mai multă forță „loviturii” unui creator de documentație tehnică pe parcursul zilei. Tabelul de mai jos conține o listă de concepte (în principal funcționalități sau categorii de funcționalități specifice suplimentului), fiecare cu o scurtă descriere bazată pe experiența personală.

source: Eating our own dog food?
ro: Folosim propriile noastre instrumente?

source: Are we using AI tools ourselves? Yes, I have started using AI tools more and more to improve readability and fix grammar or logical inconsistencies in articles like this one. I don't ask the AI to create new article ideas, but I do use AI tools to make the content I write easier to read and understand.
ro: Folosim noi înșine instrumente AI? Da, am început să folosesc tot mai mult instrumente AI pentru a îmbunătăți lizibilitatea și a corecta probleme gramaticale sau de logică în articole ca acesta. Nu cer AI-ului să creeze idei noi de articole, dar folosesc instrumentele AI pentru a face conținutul pe care îl scriu mai ușor de citit și de înțeles.

source: Usefulness
ro: Utilitate

source: Are AI engines useful for a technical writer's work? Definitely yes. People might think they can just send the AI a bunch of content with a simple instruction like <codeph class="+ topic/ph pr-d/codeph ">Spell check this content</codeph> and the AI will always return the correct content. The AI engine gives meaningful answers when the prompt is detailed and precise. This is why we include many predefined actions with our add-on.
ro: Sunt motoarele AI utile pentru activitatea unui creator de documentație tehnică? Cu siguranță, da. Unii ar putea crede că pot trimite AI-ului o mulțime de conținut cu o instrucțiune simplă, precum <codeph class="+ topic/ph pr-d/codeph ">Spell check this content</codeph>, iar AI-ul va returna întotdeauna conținutul corect. Motorul AI oferă răspunsuri relevante atunci când promptul este detaliat și precis. De aceea includem multe acțiuni predefinite în suplimentul nostru.

source: Platform availability
ro: Disponibilitate pe platforme

source: From the start, we wanted the add-on to work for both the desktop Oxygen application and the WebAuthor in-browser editor. We included core features like predefined actions, chat support, and the ability to create custom actions. This way, we can offer most of these features on both the desktop and the web application.
ro: De la început, am dorit ca suplimentul să funcționeze atât pentru aplicația desktop Oxygen, cât și pentru editorul în browser WebAuthor. Am inclus funcționalități de bază precum acțiuni predefinite, suport pentru chat și posibilitatea de a crea acțiuni personalizate. Astfel, putem oferi majoritatea acestor funcționalități atât pe aplicația desktop, cât și pe cea web.

source: AI engine choice flexibility
ro: Flexibilitate în alegerea motorului AI

source: Our initial offer was a <b class="+ topic/ph hi-d/b ">subscription</b>-based license using the Oxygen AI Positron Platform as a bridge to OpenAI. We noticed that some companies wanted a choice of which AI engine to use, so we created the <uicontrol class="+ topic/ph ui-d/uicontrol ">Oxygen AI Positron Enterprise</uicontrol> add-on. This add-on allows companies to use their own AI engine directly, with support for connectors to <b class="+ topic/ph hi-d/b ">OpenAI</b>, <b class="+ topic/ph hi-d/b ">Microsoft Azure OpenAI</b>, and <b class="+ topic/ph hi-d/b ">Anthropic Claude</b>. There are also proxy servers that can wrap many AI engines like <b class="+ topic/ph hi-d/b ">LLama</b> and <b class="+ topic/ph hi-d/b ">Mistral</b>, allowing them to be accessed using the OpenAI interface. Is the current flexibility we offer enough? Not in all cases. We plan to allow developers to create their own connectors to use their own APIs to access the engines.
ro: Oferta noastră inițială a fost o licență bazată pe <b class="+ topic/ph hi-d/b ">abonament</b>, folosind platforma Oxygen AI Positron ca punte către OpenAI. Am observat că unele companii doresc să poată alege ce motor AI să folosească, așa că am creat suplimentul <uicontrol class="+ topic/ph ui-d/uicontrol ">Oxygen AI Positron Enterprise</uicontrol>. Acest supliment permite companiilor să utilizeze direct propriul motor AI, cu suport pentru conectori către <b class="+ topic/ph hi-d/b ">OpenAI</b>, <b class="+ topic/ph hi-d/b ">Microsoft Azure OpenAI</b> și <b class="+ topic/ph hi-d/b ">Anthropic Claude</b>. Există și servere proxy care pot integra mai multe motoare AI precum <b class="+ topic/ph hi-d/b ">LLama</b> și <b class="+ topic/ph hi-d/b ">Mistral</b>, permițând accesarea lor prin interfața OpenAI. Este flexibilitatea actuală suficientă? Nu în toate cazurile. Plănuim să permitem dezvoltatorilor să creeze propriii conectori pentru a folosi propriile API-uri de acces la motoare.

source: So are all AI engines equal? Our predefined actions have and are actively tested with <b class="+ topic/ph hi-d/b ">OpenAI</b> engines and with engines provided by <b class="+ topic/ph hi-d/b ">Anthropic Claude</b>. We also tried to use engines like <b class="+ topic/ph hi-d/b ">Llama 3.1</b> or <b class="+ topic/ph hi-d/b ">Mistral</b> with our current predefined actions but the results are not fantastic, as the possibility to obtain broken <b class="+ topic/ph hi-d/b ">DITA XML</b> content with these open source engines is much higher.
ro: Deci toate motoarele AI sunt egale? Acțiunile noastre predefinite au fost și sunt testate activ cu motoarele <b class="+ topic/ph hi-d/b ">OpenAI</b> și cu cele oferite de <b class="+ topic/ph hi-d/b ">Anthropic Claude</b>. Am încercat să folosim și motoare precum <b class="+ topic/ph hi-d/b ">Llama 3.1</b> sau <b class="+ topic/ph hi-d/b ">Mistral</b> cu acțiunile noastre predefinite actuale, dar rezultatele nu sunt grozave, deoarece posibilitatea de a obține conținut <b class="+ topic/ph hi-d/b ">DITA XML</b> defect cu aceste motoare open source este mult mai mare.

source: Predefined actions
ro: Acțiuni predefinite

source: Over time, we improved how we write prompts for the many <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__section_z5l_qbx_jbc" scope="external" class="- topic/xref " format="html">predefined actions</xref> that come with the add-on. For each action, we try to give a clear prompt with lots of details so the AI engine can produce the best results. We test our predefined actions using both manual and automatic tests. We got the best results with Open AI GPT-4 engines and the engines provided by <b class="+ topic/ph hi-d/b ">Anthropic Claude</b>, like <b class="+ topic/ph hi-d/b ">Sonnet</b>.
ro: De-a lungul timpului, am îmbunătățit modul în care scriem prompturi pentru numeroasele <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__section_z5l_qbx_jbc" scope="external" class="- topic/xref " format="html">acțiuni predefinite</xref> care vin cu suplimentul. Pentru fiecare acțiune, încercăm să oferim un prompt clar, cu multe detalii, astfel încât motorul AI să poată produce cele mai bune rezultate. Testăm acțiunile predefinite atât manual, cât și automat. Am obținut cele mai bune rezultate cu motoarele Open AI GPT-4 și cu cele oferite de <b class="+ topic/ph hi-d/b ">Anthropic Claude</b>, precum <b class="+ topic/ph hi-d/b ">Sonnet</b>.

source: Custom actions
ro: Acțiuni personalizate

source: We wanted to give companies the flexibility to create their own <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/creating_custom_ai_actions.html" scope="external" class="- topic/xref " format="html">custom actions</xref> using specific prompts to solve their unique problems. With the add-on, we provide a <b class="+ topic/ph hi-d/b ">JSON</b> schema that defines all aspects of implementing custom AI actions. The key to a successful action is to make it as precise and detailed as possible.
ro: Am dorit să oferim companiilor flexibilitatea de a crea propriile <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/creating_custom_ai_actions.html" scope="external" class="- topic/xref " format="html">acțiuni personalizate</xref> folosind prompturi specifice pentru a rezolva problemele lor unice. Odată cu suplimentul, oferim o schemă <b class="+ topic/ph hi-d/b ">JSON</b> care definește toate aspectele implementării acțiunilor AI personalizate. Cheia unei acțiuni de succes este să fie cât mai precisă și detaliată posibil.

source: Content generation
ro: Generare de conținut

source: There are two main ways AI-based content generation can be useful:
ro: Există două moduri principale în care generarea de conținut bazată pe AI poate fi utilă:

source: Summarizing a large amount of text. For example, predefined actions like <uicontrol class="+ topic/ph ui-d/uicontrol ">Short Description</uicontrol> try to summarize a big piece of content. These actions usually work very well.
ro: Rezumatul unei cantități mari de text. De exemplu, acțiuni predefinite precum <uicontrol class="+ topic/ph ui-d/uicontrol ">Short Description</uicontrol> încearcă să rezume un conținut amplu. Aceste acțiuni funcționează de obicei foarte bine.

source: Expanding a small amount of text. Content generation actions like <uicontrol class="+ topic/ph ui-d/uicontrol ">Add Structured Content</uicontrol> or <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate Documentation Draft</uicontrol> use the AI engine to expand existing content and create valid DITA XML content. Since AI engines can make mistakes if they don't have enough details, we added support for <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/tools_rag_preferences.html" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">RAG</b></xref> (retrieval augmented generation) functions. These functions use the existing project content to give the AI engine enough useful information to create new DITA XML content. A common use for a writer is to gather data from different sources and create a first draft of a DITA XML topic, which they can refine later. This is what we aim to provide with our predefined actions.
ro: Extinderea unei cantități mici de text. Acțiuni de generare de conținut precum <uicontrol class="+ topic/ph ui-d/uicontrol ">Add Structured Content</uicontrol> sau <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate Documentation Draft</uicontrol> folosesc motorul AI pentru a extinde conținutul existent și a crea conținut DITA XML valid. Deoarece motoarele AI pot face greșeli dacă nu au suficiente detalii, am adăugat suport pentru funcții <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/tools_rag_preferences.html" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">RAG</b></xref> (retrieval augmented generation). Aceste funcții folosesc conținutul existent al proiectului pentru a oferi motorului AI suficiente informații utile pentru a crea conținut DITA XML nou. O utilizare comună pentru un redactor este să adune date din surse diferite și să creeze o primă variantă de topic DITA XML, pe care să o rafineze ulterior. Acesta este scopul pe care îl urmărim cu acțiunile noastre predefinite.

source: Vision support
ro: Suport pentru viziune

source: Certain actions like <b class="+ topic/ph hi-d/b ">Generate Image Alternate Text</b>, <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate Documentation Draft</uicontrol>, or <b class="+ topic/ph hi-d/b ">Update Content Based on Images</b> use the capabilities of engines like <b class="+ topic/ph hi-d/b ">GPT-4o</b>. These engines read content from images provided by the user and then use that information to write new DITA XML content or update existing content. In our experience, these kinds of actions are useful and work quite well to update DITA XML content based on application screenshots.
ro: Anumite acțiuni precum <b class="+ topic/ph hi-d/b ">Generate Image Alternate Text</b>, <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate Documentation Draft</uicontrol> sau <b class="+ topic/ph hi-d/b ">Update Content Based on Images</b> folosesc capabilitățile unor motoare precum <b class="+ topic/ph hi-d/b ">GPT-4o</b>. Aceste motoare citesc conținut din imagini furnizate de utilizator și apoi folosesc acele informații pentru a scrie conținut DITA XML nou sau pentru a actualiza conținutul existent. Din experiența noastră, astfel de acțiuni sunt utile și funcționează destul de bine pentru a actualiza conținutul DITA XML pe baza capturilor de ecran ale aplicațiilor.

source: Rewrite actions
ro: Acțiuni de rescriere

source: We created useful actions to <b class="+ topic/ph hi-d/b ">Correct Grammar</b>, <b class="+ topic/ph hi-d/b ">Improve Readability</b>, <b class="+ topic/ph hi-d/b ">Use Active Voice</b>, and <b class="+ topic/ph hi-d/b ">Improve Structure</b>. These actions are applied to existing content, they have precise prompts that instruct the AI to preserve the existing content as much as possible, and they are solid examples of how the AI can help a writer during their daily work.
ro: Am creat acțiuni utile pentru <b class="+ topic/ph hi-d/b ">corectarea gramaticii</b>, <b class="+ topic/ph hi-d/b ">îmbunătățirea lizibilității</b>, <b class="+ topic/ph hi-d/b ">utilizarea vocii active</b> și <b class="+ topic/ph hi-d/b ">îmbunătățirea structurii</b>. Aceste acțiuni se aplică pe conținutul existent, au prompturi precise care instruiesc AI-ul să păstreze cât mai mult din conținutul existent și sunt exemple solide despre cum AI-ul poate ajuta un redactor în activitatea zilnică.

source: Review actions
ro: Acțiuni de revizuire

source: At some point, we had the idea that the AI, instead of fixing problems, could leave the original content as it is and just add comments around the content that needs to be changed. So, the <b class="+ topic/ph hi-d/b ">Proofread</b> action appeared as a way to allow the AI engine to give advice on existing content without making any changes. In a way, the AI engine becomes a reviewer of a first document draft. The <b class="+ topic/ph hi-d/b ">Resolve Comments</b> action appeared as a way to allow the AI engine to fix existing comments by changing the content.
ro: La un moment dat, am avut ideea ca AI-ul, în loc să corecteze problemele, să lase conținutul original așa cum este și doar să adauge comentarii în jurul conținutului care trebuie modificat. Astfel a apărut acțiunea <b class="+ topic/ph hi-d/b ">Proofread</b>, ca o modalitate prin care motorul AI poate oferi sfaturi pe conținutul existent fără a face modificări. Într-un fel, motorul AI devine un recenzent al unei prime variante de document. Acțiunea <b class="+ topic/ph hi-d/b ">Resolve Comments</b> a apărut ca o modalitate prin care motorul AI poate rezolva comentariile existente prin modificarea conținutului.

source: Overview actions
ro: Acțiuni de prezentare generală

source: We created some useful actions to <b class="+ topic/ph hi-d/b ">Summarize</b> or report on the <b class="+ topic/ph hi-d/b ">Readability</b> of a DITA XML topic. We also created actions to use AI to better understand what questions a certain topic answers. In the future, using an AI engine might also include asking the AI to find <b class="+ topic/ph hi-d/b ">logical inconsistencies</b> in already written content that may be too large for a person to fully digest easily.
ro: Am creat acțiuni utile pentru a <b class="+ topic/ph hi-d/b ">rezuma</b> sau a raporta <b class="+ topic/ph hi-d/b ">lizibilitatea</b> unui topic DITA XML. Am creat și acțiuni care folosesc AI-ul pentru a înțelege mai bine la ce întrebări răspunde un anumit topic. În viitor, utilizarea unui motor AI ar putea include și solicitarea ca AI-ul să găsească <b class="+ topic/ph hi-d/b ">inconsecvențe logice</b> în conținut deja scris, care poate fi prea voluminos pentru a fi parcurs cu ușurință de o persoană.

source: Translate actions
ro: Acțiuni de traducere

source: There are studies that say the translation abilities in AI engines are better than <b class="+ topic/ph hi-d/b ">Google Translate</b> or <b class="+ topic/ph hi-d/b ">DeepL</b>. The available translation actions have clear prompts that tell the AI engine to skip certain DITA XML tags like <xmlelement class="+ topic/keyword markup-d/markupname xml-d/xmlelement ">codeblock</xmlelement> or <xmlelement class="+ topic/keyword markup-d/markupname xml-d/xmlelement ">codeph</xmlelement>. In general, they seem to do a good job of keeping the existing DITA XML structure, including the parts of reusable content and key references.
ro: Există studii care spun că abilitățile de traducere ale motoarelor AI sunt mai bune decât cele ale <b class="+ topic/ph hi-d/b ">Google Translate</b> sau <b class="+ topic/ph hi-d/b ">DeepL</b>. Acțiunile de traducere disponibile au prompturi clare care indică motorului AI să ignore anumite etichete DITA XML precum <xmlelement class="+ topic/keyword markup-d/markupname xml-d/xmlelement ">codeblock</xmlelement> sau <xmlelement class="+ topic/keyword markup-d/markupname xml-d/xmlelement ">codeph</xmlelement>. În general, acestea par să păstreze bine structura DITA XML existentă, inclusiv părțile de conținut reutilizabil și referințele cheie.

source: Intelligent agents
ro: Agenți inteligenți

source: In the most recent add-on release, we added new actions like <b class="+ topic/ph hi-d/b ">Split Topic</b> and <b class="+ topic/ph hi-d/b ">Create Topics</b>. These actions give the AI more freedom to process existing content and create new topics on disk. The AI uses a feedback loop where it first proposes a plan of action, evaluates how the content could be changed, and then makes the necessary changes. These actions try to use the AI engine's potential to the max by letting it plan and execute more complex tasks.
ro: În cea mai recentă versiune a suplimentului, am adăugat acțiuni noi precum <b class="+ topic/ph hi-d/b ">Split Topic</b> și <b class="+ topic/ph hi-d/b ">Create Topics</b>. Aceste acțiuni oferă AI-ului mai multă libertate de a procesa conținutul existent și de a crea noi topicuri pe disc. AI-ul folosește un ciclu de feedback în care propune mai întâi un plan de acțiune, evaluează cum ar putea fi modificat conținutul și apoi face modificările necesare. Aceste acțiuni încearcă să folosească la maximum potențialul motorului AI, permițându-i să planifice și să execute sarcini mai complexe.

source: Reuse actions
ro: Acțiuni de reutilizare

source: <b class="+ topic/ph hi-d/b ">DITA XML</b> is about content reuse. So, how can the AI engine help with this? For now, we have created two predefined actions. These actions use functions to let the AI engine access already reusable components. One action replaces product names with existing key references. The other action retrieves the closest reusable component to the currently selected paragraph. But I think more can be done in this area in the future.
ro: <b class="+ topic/ph hi-d/b ">DITA XML</b> înseamnă reutilizarea conținutului. Cum poate ajuta motorul AI în acest sens? Pentru moment, am creat două acțiuni predefinite. Aceste acțiuni folosesc funcții care permit motorului AI să acceseze deja componente reutilizabile. O acțiune înlocuiește numele produselor cu referințe cheie existente. Cealaltă acțiune recuperează cea mai apropiată componentă reutilizabilă față de paragraful selectat. Dar cred că se pot face mai multe în acest domeniu pe viitor.

source: Using AI engines means accepting that an action might not always give the right content. We give you control to preview the changes suggested by the AI and then keep chatting with the AI to fine-tune the answer until it is correct.
ro: Folosirea motoarelor AI înseamnă să accepți că o acțiune s-ar putea să nu ofere întotdeauna conținutul corect. Îți oferim controlul de a previzualiza modificările sugerate de AI și apoi să continui conversația cu AI-ul pentru a rafina răspunsul până când este corect.
