Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: Use the <b class="+ topic/ph hi-d/b ">New Document</b> wizard to create an <b class="+ topic/ph hi-d/b ">AI Positron Custom Action</b> file. This file contains an action definition in JSON format, where you can specify the action's intent, parameters, and AI logic.
ro: Folosiți expertul <b class="+ topic/ph hi-d/b ">New Document</b> pentru a crea un fișier <b class="+ topic/ph hi-d/b ">AI Positron Custom Action</b>. Acest fișier conține o definiție de acțiune în format JSON, unde puteți specifica scopul acțiunii, parametrii și logica AI.

source: Oxygen offers automatic <b class="+ topic/ph hi-d/b ">validation</b> and <b class="+ topic/ph hi-d/b ">content completion</b> for these files, so you can edit and maintain them with confidence. Work in <b class="+ topic/ph hi-d/b ">text mode</b> for exact control, or switch to the <b class="+ topic/ph hi-d/b ">Author visual editing mode</b> for a guided, interactive experience.
ro: Oxygen oferă <b class="+ topic/ph hi-d/b ">validare</b> automată și <b class="+ topic/ph hi-d/b ">completare de conținut</b> pentru aceste fișiere, astfel încât să le puteți edita și menține cu încredere. Lucrați în <b class="+ topic/ph hi-d/b ">mod text</b> pentru control exact sau comutați în <b class="+ topic/ph hi-d/b ">modul vizual Author</b> pentru o experiență ghidată și interactivă.

source: For example, you can create an AI action that generates a new XSLT document from specific content with a simple guided workflow. You define the action logic and workflow in JSON, and the integrated AI produces a complete XSLT stylesheet based on your instructions.
ro: De exemplu, puteți crea o acțiune AI care generează un document XSLT nou dintr-un anumit conținut, printr-un flux de lucru ghidat. Definiți logica și fluxul acțiunii în JSON, iar AI-ul integrat produce o foaie de stil XSLT completă pe baza instrucțiunilor dvs.

source: The following JSON shows a custom AI action that generates an XSLT 3.0 document based on provided source content:
ro: Următorul JSON prezintă o acțiune AI personalizată care generează un document XSLT 3.0 pe baza conținutului furnizat:

source: In <b class="+ topic/ph hi-d/b ">Author mode</b>, this action appears as a structured form, allowing you to configure and review the action visually:
ro: În <b class="+ topic/ph hi-d/b ">modul Author</b>, această acțiune apare ca un formular structurat, permițând configurarea și revizuirea vizuală a acțiunii:

source: Custom AI Action in Author Mode
ro: Acțiune AI personalizată în modul Author

source: [ The <b class="+ topic/ph hi-d/b ">Create New XSLT</b> action displayed in Author mode, with editable fields and advanced AI parameters. ]
ro: [ Acțiunea <b class="+ topic/ph hi-d/b ">Create New XSLT</b> afișată în modul Author, cu câmpuri editabile și parametri AI avansați. ]

source: In this setup, you supply context, objectives, the desired output action, and any helper functions (such as extracting content from a document URL). The AI then generates the XSLT file and returns only the requested code.
ro: În această configurație, furnizați context, obiective, acțiunea de ieșire dorită și orice funcții ajutătoare (cum ar fi extragerea conținutului dintr-un URL de document). AI-ul generează apoi fișierul XSLT și returnează doar codul solicitat.

source: For a detailed walkthrough on creating and customizing AI actions in Oxygen, see the official documentation: <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/creating_custom_ai_actions.html" scope="external" class="- topic/xref " format="html">Creating Custom AI Actions in Oxygen</xref>.
ro: Pentru un ghid detaliat despre crearea și personalizarea acțiunilor AI în Oxygen, consultați documentația oficială: <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/creating_custom_ai_actions.html" scope="external" class="- topic/xref " format="html">Creating Custom AI Actions in Oxygen</xref>.

source: <b class="+ topic/ph hi-d/b ">Video Tutorial:</b> <xref href="https://youtu.be/s7fppQS0w_c?si=DnFWym9JC08MbJ1g###AMP###t=2001" scope="external" class="- topic/xref " format="html"> How to Create Custom AI Actions in Oxygen </xref>
ro: <b class="+ topic/ph hi-d/b ">Tutorial video:</b> <xref href="https://youtu.be/s7fppQS0w_c?si=DnFWym9JC08MbJ1g###AMP###t=2001" scope="external" class="- topic/xref " format="html"> Cum să creați acțiuni AI personalizate în Oxygen </xref>

source: Tips and Best Practices
ro: Sfaturi și bune practici

source: <b class="+ topic/ph hi-d/b ">Focused Selection:</b> Select small code blocks for targeted explanations and documentation.
ro: <b class="+ topic/ph hi-d/b ">Selecție focalizată:</b> Selectați blocuri mici de cod pentru explicații și documentare țintite.

source: <b class="+ topic/ph hi-d/b ">Iterative Chat:</b> Use the <i class="+ topic/ph hi-d/i ">Chat About Code</i> action for ongoing improvements, to ask questions, make changes, and regenerate code snippets interactively.
ro: <b class="+ topic/ph hi-d/b ">Chat iterativ:</b> Folosiți acțiunea <i class="+ topic/ph hi-d/i ">Chat About Code</i> pentru îmbunătățiri continue, pentru a pune întrebări, a face modificări și a regenera fragmente de cod interactiv.

source: <b class="+ topic/ph hi-d/b ">Refactor Files:</b> Run the <i class="+ topic/ph hi-d/i ">Suggest Refactoring</i> action on your code to update it to modern standards and to create more readable, reusable modules.
ro: <b class="+ topic/ph hi-d/b ">Refactorizați fișierele:</b> Rulați acțiunea <i class="+ topic/ph hi-d/i ">Suggest Refactoring</i> pe codul dvs. pentru a-l aduce la standarde moderne și pentru a crea module mai lizibile și reutilizabile.

source: <b class="+ topic/ph hi-d/b ">Comprehensive Comments:</b> Annotate large, multi-template XSLT or XSD files to improve shared understanding and make onboarding easier.
ro: <b class="+ topic/ph hi-d/b ">Comentarii cuprinzătoare:</b> Anotați fișiere XSLT sau XSD mari, cu mai multe șabloane, pentru a îmbunătăți înțelegerea comună și a facilita onboarding-ul.

source: <b class="+ topic/ph hi-d/b ">Explore Samples:</b> Review and adapt <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Code%20Development" scope="external" class="- topic/xref " format="html">provided samples</xref> to help your team get started quickly.
ro: <b class="+ topic/ph hi-d/b ">Explorați exemplele:</b> Examinați și adaptați <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Code%20Development" scope="external" class="- topic/xref " format="html">exemplele furnizate</xref> pentru a ajuta echipa să înceapă rapid.

source: Conclusion
ro: Concluzie

source: AI-driven actions in Oxygen XML Editor are changing how developers approach code understanding, editing, and maintenance. Whether you’re explaining a Schematron rule, documenting a schema, generating new validation logic, or refactoring for the future, AI Positron delivers efficiency at every step. Take advantage of these tools to elevate your XML development workflow.
ro: Acțiunile bazate pe AI din Oxygen XML Editor schimbă modul în care dezvoltatorii abordează înțelegerea, editarea și mentenanța codului. Fie că explicați o regulă Schematron, documentați o schemă, generați logică nouă de validare sau refactorizați pentru viitor, AI Positron oferă eficiență la fiecare pas. Profitați de aceste instrumente pentru a vă îmbunătăți fluxul de lucru în dezvoltarea XML.

source: To experiment and learn more, check out the <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Code%20Development" scope="external" class="- topic/xref " format="html">Code Development</xref> subfolder in the AI Positron samples project.
ro: Pentru a experimenta și a afla mai multe, consultați subfolderul <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Code%20Development" scope="external" class="- topic/xref " format="html">Code Development</xref> din proiectul de exemple AI Positron.

source: The <b class="+ topic/ph hi-d/b ">Oxygen AI Positron</b> add-on provides support for helping technical documentation writers <b class="+ topic/ph hi-d/b ">generate</b>, <b class="+ topic/ph hi-d/b ">re-write</b> content, <b class="+ topic/ph hi-d/b ">overview</b> and <b class="+ topic/ph hi-d/b ">research</b>. It also supports performing AI checks and AI-based modifications on <b class="+ topic/ph hi-d/b ">multiple files</b> by integrating AI extensions with XML technologies like <b class="+ topic/ph hi-d/b ">Schematron</b> or <b class="+ topic/ph hi-d/b ">XSLT</b>.
ro: Suplimentul <b class="+ topic/ph hi-d/b ">Oxygen AI Positron</b> oferă suport pentru a ajuta creatorii de documentație tehnică să <b class="+ topic/ph hi-d/b ">genereze</b>, să <b class="+ topic/ph hi-d/b ">rescrie</b> conținut, să realizeze <b class="+ topic/ph hi-d/b ">prezentări generale</b> și <b class="+ topic/ph hi-d/b ">cercetare</b>. De asemenea, permite efectuarea de verificări AI și modificări bazate pe AI asupra <b class="+ topic/ph hi-d/b ">mai multor fișiere</b> prin integrarea extensiilor AI cu tehnologii XML precum <b class="+ topic/ph hi-d/b ">Schematron</b> sau <b class="+ topic/ph hi-d/b ">XSLT</b>.

source: artificial intelligence
ro: inteligență artificială

source: This article is intended to be a general overview of the <b class="+ topic/ph hi-d/b ">Oxygen AI Positron</b> add-on installation, licensing, and functionality.
ro: Acest articol își propune să ofere o prezentare generală a instalării, licențierii și funcționalității suplimentului <b class="+ topic/ph hi-d/b ">Oxygen AI Positron</b>.

source: We've envisioned this add-on as a way to offer you a personal assistant that contains useful actions for checking content (readability, grammar), translating, explaining, and creating overviews.
ro: Am conceput acest supliment ca pe o modalitate de a vă oferi un asistent personal care conține acțiuni utile pentru verificarea conținutului (lizibilitate, gramatică), traducere, explicare și crearea de prezentări generale.

source: Installation and Licensing Overview
ro: Prezentare generală a instalării și licențierii

source: Oxygen desktop allows installing the commercial <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/ai_positron-installation.html" scope="external" class="- topic/xref " format="html">AI Positron add-on</xref>. There are two main ways to connect and work with LLM models:
ro: Oxygen desktop permite instalarea suplimentului comercial <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/ai_positron-installation.html" scope="external" class="- topic/xref " format="html">AI Positron</xref>. Există două modalități principale de a vă conecta și de a lucra cu modele LLM:

source: A subscription-based model using the <xref href="https://www.oxygenxml.com/aipositron/user_terms.html" scope="external" class="- topic/xref " format="html">Oxygen Positron Service</xref> platform, which in turn allows you access to the <b class="+ topic/ph hi-d/b ">OpenAI</b>, <b class="+ topic/ph hi-d/b ">Claude</b> or <b class="+ topic/ph hi-d/b ">Google Gemini</b> LLMs.
ro: Un model bazat pe abonament, folosind platforma <xref href="https://www.oxygenxml.com/aipositron/user_terms.html" scope="external" class="- topic/xref " format="html">Oxygen Positron Service</xref>, care vă permite accesul la LLM-urile <b class="+ topic/ph hi-d/b ">OpenAI</b>, <b class="+ topic/ph hi-d/b ">Claude</b> sau <b class="+ topic/ph hi-d/b ">Google Gemini</b>.

source: Users can create new subscription accounts or authenticate using their existing <b class="+ topic/ph hi-d/b ">Google</b> or <b class="+ topic/ph hi-d/b ">Github</b> accounts. The first subscription month is free and a <xref href="https://www.oxygenxml.com/ai_positron_service/buy.html" scope="external" class="- topic/xref " format="html">monthly subscription</xref> can be purchased to receive a number of credits each month.
ro: Utilizatorii pot crea conturi noi de abonament sau se pot autentifica folosind conturile existente <b class="+ topic/ph hi-d/b ">Google</b> sau <b class="+ topic/ph hi-d/b ">Github</b>. Prima lună de abonament este gratuită, iar un <xref href="https://www.oxygenxml.com/ai_positron_service/buy.html" scope="external" class="- topic/xref " format="html">abonament lunar</xref> poate fi achiziționat pentru a primi un anumit număr de credite în fiecare lună.

source: You can control which AI engine is used by default for performing actions and for chatting. This can be done from the Preferences page or from the chat view.
ro: Puteți controla ce motor AI este folosit implicit pentru acțiuni și pentru chat. Acest lucru se poate face din pagina de Preferințe sau din vizualizarea de chat.

source: Connect to your own own AI engine server. The following connection types are supported:
ro: Conectați-vă la propriul server AI. Sunt acceptate următoarele tipuri de conexiuni:

source: <b class="+ topic/ph hi-d/b ">OpenAI</b> - Connect to your own OpenAI server using your own key. Or connect to OpenAI-compatible servers like <b class="+ topic/ph hi-d/b ">Ollama</b>.
ro: <b class="+ topic/ph hi-d/b ">OpenAI</b> - Conectați-vă la propriul server OpenAI folosind cheia proprie. Sau conectați-vă la servere compatibile OpenAI precum <b class="+ topic/ph hi-d/b ">Ollama</b>.

source: <b class="+ topic/ph hi-d/b ">Microsoft Azure Open AI</b> - Connect to an Open AI instance hosted as a virtual machine on Microsoft Azure.
ro: <b class="+ topic/ph hi-d/b ">Microsoft Azure Open AI</b> - Conectați-vă la o instanță Open AI găzduită ca mașină virtuală pe Microsoft Azure.

source: <b class="+ topic/ph hi-d/b ">Anthropic Claude</b> - Connect to Anthropic Claude using your own key.
ro: <b class="+ topic/ph hi-d/b ">Anthropic Claude</b> - Conectați-vă la Anthropic Claude folosind cheia proprie.

source: From the licensing point of view, the <b class="+ topic/ph hi-d/b ">AI Positron Enterprise</b> add-on works free of charge with any Oxygen XML Editor installation using an <b class="+ topic/ph hi-d/b ">Enterprise</b> license type for Oxygen XML Editor. For other cases, <xref href="https://www.oxygenxml.com/ai_positron_desktop/buy.html" scope="external" class="- topic/xref " format="html">a special license key</xref> needs to be purchased for the add-on to enable this direct access. You can use the Register button in the AI Positron side view to configure the special license key.
ro: Din punct de vedere al licențierii, suplimentul <b class="+ topic/ph hi-d/b ">AI Positron Enterprise</b> funcționează gratuit cu orice instalare Oxygen XML Editor care utilizează un tip de licență <b class="+ topic/ph hi-d/b ">Enterprise</b> pentru Oxygen XML Editor. În celelalte cazuri, <xref href="https://www.oxygenxml.com/ai_positron_desktop/buy.html" scope="external" class="- topic/xref " format="html">trebuie achiziționată o cheie de licență specială</xref> pentru ca suplimentul să permită acest acces direct. Puteți folosi butonul Register din panoul lateral AI Positron pentru a configura cheia de licență specială.

source: <xref href="https://www.oxygenxml.com/doc/ug-webauthor/topics/wa-ai-positron.html" scope="external" class="- topic/xref " format="html">Oxygen XML Web Author</xref> also allows installing an <b class="+ topic/ph hi-d/b ">AI Positron</b> plugin with similar functionality as the one in the Oxygen Desktop application.
ro: <xref href="https://www.oxygenxml.com/doc/ug-webauthor/topics/wa-ai-positron.html" scope="external" class="- topic/xref " format="html">Oxygen XML Web Author</xref> permite, de asemenea, instalarea unui plugin <b class="+ topic/ph hi-d/b ">AI Positron</b> cu funcționalitate similară cu cea din aplicația Oxygen Desktop.

source: Integration and Features Overview
ro: Prezentare generală a integrării și funcționalităților

source: After installing the add-on, the following features are available in the Oxygen desktop:
ro: După instalarea suplimentului, următoarele funcționalități sunt disponibile în Oxygen desktop:

source: <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__section_a3d_sgl_4xb" scope="external" class="- topic/xref " format="html">AI Positron</xref> side view. This side view contains the following functionality:
ro: Panoul lateral <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__section_a3d_sgl_4xb" scope="external" class="- topic/xref " format="html">AI Positron</xref>. Acest panou conține următoarele funcționalități:

source: Invoke various actions to generate and re-write content using AI.
ro: Apelați diverse acțiuni pentru a genera și rescrie conținut folosind AI.

source: <b class="+ topic/ph hi-d/b ">Chat</b> with the AI.
ro: <b class="+ topic/ph hi-d/b ">Chat</b> cu AI-ul.

source: A <b class="+ topic/ph hi-d/b ">History</b> list of previous interactions.
ro: O listă <b class="+ topic/ph hi-d/b ">History</b> cu interacțiunile anterioare.

source: A <b class="+ topic/ph hi-d/b ">Favorites</b> drop-down list and a way to mark inputs as favorites.
ro: O listă derulantă <b class="+ topic/ph hi-d/b ">Favorites</b> și o modalitate de a marca intrările ca favorite.

source: The <b class="+ topic/ph hi-d/b ">Insert Editor Variables</b> drop-down list allows inserting various editor variables which are expanded when the chat message is sent to the AI engine.
ro: Lista derulantă <b class="+ topic/ph hi-d/b ">Insert Editor Variables</b> permite inserarea diferitelor variabile de editor care sunt expandate când mesajul de chat este trimis către motorul AI.

source: An <b class="+ topic/ph hi-d/b ">Attach</b> button to attach images or XML text resources to the chat message.
ro: Un buton <b class="+ topic/ph hi-d/b ">Attach</b> pentru a atașa imagini sau resurse text XML la mesajul de chat.

source: <b class="+ topic/ph hi-d/b ">AI</b> main menu entry with support to invoke actions or to go to the add-on's preferences page.
ro: Intrare principală de meniu <b class="+ topic/ph hi-d/b ">AI</b> cu suport pentru a apela acțiuni sau pentru a accesa pagina de preferințe a suplimentului.

source: <b class="+ topic/ph hi-d/b ">AI Positron</b> contextual menu for all XML documents opened in the <b class="+ topic/ph hi-d/b ">Author</b> visual editing mode.
ro: Meniu contextual <b class="+ topic/ph hi-d/b ">AI Positron</b> pentru toate documentele XML deschise în <b class="+ topic/ph hi-d/b ">modul vizual Author</b>.

source: <b class="+ topic/ph hi-d/b ">AI Positron</b> quick assist actions available on the left vertical stripe for all XML documents opened in the <b class="+ topic/ph hi-d/b ">Author</b> visual editing mode.
ro: Acțiuni rapide <b class="+ topic/ph hi-d/b ">AI Positron</b> disponibile pe bara verticală din stânga pentru toate documentele XML deschise în <b class="+ topic/ph hi-d/b ">modul vizual Author</b>.

source: <b class="+ topic/ph hi-d/b ">AI Positron Refactoring</b> actions added to the <b class="+ topic/ph hi-d/b ">Project</b> and <b class="+ topic/ph hi-d/b ">DITA Maps Manager</b> views as a way to run actions on multiple files.
ro: Acțiuni <b class="+ topic/ph hi-d/b ">AI Positron Refactoring</b> adăugate în vizualizările <b class="+ topic/ph hi-d/b ">Project</b> și <b class="+ topic/ph hi-d/b ">DITA Maps Manager</b> ca modalitate de a rula acțiuni pe mai multe fișiere.

source: When validation problems are displayed in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Results</uicontrol> pane, you can right-click on a problem and use the <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron Fix</uicontrol> action to ask the <b class="+ topic/ph hi-d/b ">AI Positron</b> platform for help with fixing the problem. It will propose content in the chat pane (within the <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> view) that can be used to solve the problem.
ro: Când problemele de validare sunt afișate în panoul <uicontrol class="+ topic/ph ui-d/uicontrol ">Results</uicontrol>, puteți face clic dreapta pe o problemă și folosi acțiunea <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron Fix</uicontrol> pentru a solicita platformei <b class="+ topic/ph hi-d/b ">AI Positron</b> ajutor la remedierea problemei. Aceasta va propune conținut în panoul de chat (din vizualizarea <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol>) care poate fi folosit pentru a rezolva problema.

source: The add-on contributes two <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__section_a3s_ngn_2ds" scope="external" class="- topic/xref " format="html">XPath extension functions</xref> (<codeph class="+ topic/ph pr-d/codeph ">ai:transform-content</codeph> and <codeph class="+ topic/ph pr-d/codeph ">ai:verify-content</codeph>) that can be used to rephrase content or to perform validation checks on existing content.
ro: Suplimentul adaugă două <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__section_a3s_ngn_2ds" scope="external" class="- topic/xref " format="html">funcții de extensie XPath</xref> (<codeph class="+ topic/ph pr-d/codeph ">ai:transform-content</codeph> și <codeph class="+ topic/ph pr-d/codeph ">ai:verify-content</codeph>) care pot fi folosite pentru a reformula conținutul sau pentru a efectua verificări de validare pe conținutul existent.

source: Predefined and Custom Actions
ro: Acțiuni predefinite și personalizate

source: Once you log in to the server, a <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__section_z5l_qbx_jbc" scope="external" class="- topic/xref " format="html">set of predefined actions</xref> are available, grouped in categories: <b class="+ topic/ph hi-d/b ">Accessibility</b>, <b class="+ topic/ph hi-d/b ">Content Generation</b>, <b class="+ topic/ph hi-d/b ">Development</b>, <b class="+ topic/ph hi-d/b ">Rewrite</b>, <b class="+ topic/ph hi-d/b ">Overview</b>, <b class="+ topic/ph hi-d/b ">Marketing</b>, and <b class="+ topic/ph hi-d/b ">Translation</b>. The <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/README.md" scope="external" class="- topic/xref " format="html">AI Positron Samples Playground</xref> samples project contains useful samples to test the functionality of these actions.
ro: Odată ce v-ați autentificat pe server, este disponibil un <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__section_z5l_qbx_jbc" scope="external" class="- topic/xref " format="html">set de acțiuni predefinite</xref>, grupate pe categorii: <b class="+ topic/ph hi-d/b ">Accessibility</b>, <b class="+ topic/ph hi-d/b ">Content Generation</b>, <b class="+ topic/ph hi-d/b ">Development</b>, <b class="+ topic/ph hi-d/b ">Rewrite</b>, <b class="+ topic/ph hi-d/b ">Overview</b>, <b class="+ topic/ph hi-d/b ">Marketing</b> și <b class="+ topic/ph hi-d/b ">Translation</b>. Proiectul de exemple <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/README.md" scope="external" class="- topic/xref " format="html">AI Positron Samples Playground</xref> conține exemple utile pentru a testa funcționalitatea acestor acțiuni.
