Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: Chatting with the AI can also be a useful way to learn how different concepts work. We added <b class="+ topic/ph hi-d/b ">RAG</b> (retrieval augmented generation) support in the chat window. This lets people search for content and get precise answers based on their own documentation project.
ro: Conversația cu AI-ul poate fi și o modalitate utilă de a învăța cum funcționează diferite concepte. Am adăugat suport pentru <b class="+ topic/ph hi-d/b ">RAG</b> (retrieval augmented generation) în fereastra de chat. Acest lucru permite utilizatorilor să caute conținut și să obțină răspunsuri precise bazate pe propriul proiect de documentație.

source: Specializations support
ro: Suport pentru specializări

source: So, how does the AI work with DITA XML specializations that might have custom <codeph class="+ topic/ph pr-d/codeph ">DOCTYPE</codeph> declarations or custom DITA XML elements?
ro: Deci, cum funcționează AI-ul cu specializările DITA XML care pot avea declarații <codeph class="+ topic/ph pr-d/codeph ">DOCTYPE</codeph> personalizate sau elemente DITA XML personalizate?

source: Most of the built-in actions should work well with DITA XML specializations. For example, actions that rewrite the content or translate it should keep the existing DITA XML elements in the selection unchanged. Actions like <b class="+ topic/ph hi-d/b ">New DITA Topic</b> create basic DITA XML topics. However, there are actions like <b class="+ topic/ph hi-d/b ">Add Structured Content</b> that expand the content of an already created DITA XML topic. This allows the user to first create the DITA XML topic based on their specialization before using the AI engine. Actions like <b class="+ topic/ph hi-d/b ">Improve Structure</b> add base DITA XML elements to the selected content, so they might not use all the specialized DITA XML elements.
ro: Majoritatea acțiunilor integrate ar trebui să funcționeze bine cu specializările DITA XML. De exemplu, acțiunile care rescriu sau traduc conținutul ar trebui să păstreze elementele DITA XML existente din selecție neschimbate. Acțiuni precum <b class="+ topic/ph hi-d/b ">New DITA Topic</b> creează topicuri DITA XML de bază. Totuși, există acțiuni precum <b class="+ topic/ph hi-d/b ">Add Structured Content</b> care extind conținutul unui topic DITA XML deja creat. Acest lucru permite utilizatorului să creeze mai întâi topicul DITA XML pe baza specializării sale, înainte de a folosi motorul AI. Acțiuni precum <b class="+ topic/ph hi-d/b ">Improve Structure</b> adaugă elemente DITA XML de bază conținutului selectat, deci s-ar putea să nu folosească toate elementele DITA XML specializate.

source: Third Party CMS support
ro: Suport pentru CMS-uri terțe

source: Both Oxygen desktop and in-browser editing tools can be integrated with various content management systems. Most AI predefined actions should work when Oxygen is integrated with a third-party CMS. However, actions that write content on disk (like actions from the <b class="+ topic/ph hi-d/b ">Intelligent agents</b> category) might not be able to create new topics on the CMS. Actions that are improved by using <b class="+ topic/ph hi-d/b ">RAG</b> (retrieval augmented generation) might also not work well since the project content is stored on the CMS. Oxygen desktop has an <uicontrol class="+ topic/ph ui-d/uicontrol ">Enable indexing for remote resources</uicontrol> checkbox in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Open/Find Resource</uicontrol> preferences page. This allows our indexing engine to index content from the CMS. But the in-browser Web Author editing tool does not yet support indexing CMS-specific content.
ro: Atât instrumentele de editare Oxygen desktop, cât și cele în browser pot fi integrate cu diverse sisteme de management al conținutului. Majoritatea acțiunilor AI predefinite ar trebui să funcționeze atunci când Oxygen este integrat cu un CMS terț. Totuși, acțiunile care scriu conținut pe disc (precum cele din categoria <b class="+ topic/ph hi-d/b ">Intelligent agents</b>) s-ar putea să nu poată crea topicuri noi pe CMS. Acțiunile care sunt îmbunătățite prin utilizarea <b class="+ topic/ph hi-d/b ">RAG</b> (retrieval augmented generation) s-ar putea să nu funcționeze bine, deoarece conținutul proiectului este stocat pe CMS. Oxygen desktop are o opțiune <uicontrol class="+ topic/ph ui-d/uicontrol ">Enable indexing for remote resources</uicontrol> în pagina de preferințe <uicontrol class="+ topic/ph ui-d/uicontrol ">Open/Find Resource</uicontrol>. Aceasta permite motorului nostru de indexare să indexeze conținutul din CMS. Însă instrumentul de editare Web Author în browser nu suportă încă indexarea conținutului specific CMS-ului.

source: I hope this article, based on my experience working on AI editing tools and with AI editing tools, will be useful to you. As always, you can leave feedback using the Oxygen Feedback form, which appears below this published article.
ro: Sper ca acest articol, bazat pe experiența mea de lucru la instrumente de editare AI și cu instrumente de editare AI, să vă fie util. Ca de obicei, puteți lăsa feedback folosind formularul Oxygen Feedback, care apare sub acest articol publicat.

source: Boosting XML Development with AI-Driven Code Actions in Oxygen XML Editor
ro: Dezvoltare XML accelerată cu acțiuni de cod bazate pe AI în Oxygen XML Editor

source: Introduction
ro: Introducere

source: Discover how AI-powered actions in Oxygen XML Editor revolutionize XML schema and XSLT stylesheet development. With AI actions to explain, annotate, generate, or document code, chat with the AI about certain code, and to suggest refactoring, these tools help developers work faster and smarter. As XML workflows become more complex, smarter tools are essential for editing, collaboration, and refactoring. The AI Positron Assistant in Oxygen XML Editor empowers users with a suite of intelligent actions designed for modern code development.
ro: Descoperiți cum acțiunile alimentate de AI din Oxygen XML Editor revoluționează dezvoltarea de scheme XML și foi de stil XSLT. Cu acțiuni AI pentru a explica, adnota, genera sau documenta codul, pentru a discuta cu AI-ul despre anumite fragmente de cod și pentru a sugera refactorizări, aceste instrumente ajută dezvoltatorii să lucreze mai rapid și mai eficient. Pe măsură ce fluxurile de lucru XML devin mai complexe, instrumentele inteligente devin esențiale pentru editare, colaborare și refactorizare. AI Positron Assistant din Oxygen XML Editor oferă utilizatorilor o suită de acțiuni inteligente concepute pentru dezvoltarea modernă a codului.

source: In this post, we’ll explore the main AI actions that act on XML-development languages, such as XML Schema, XSLT, and Schematron — <b class="+ topic/ph hi-d/b ">Explain Code</b>, <b class="+ topic/ph hi-d/b ">Chat About Code</b>, <b class="+ topic/ph hi-d/b ">Document Code</b>, <b class="+ topic/ph hi-d/b ">Annotate Code</b>, <b class="+ topic/ph hi-d/b ">Generate Code</b>, and <b class="+ topic/ph hi-d/b ">Suggest Refactoring</b>, and we'll show examples of how they boost productivity when working with XSLT.
ro: În acest articol, vom explora principalele acțiuni AI care acționează asupra limbajelor de dezvoltare XML, precum XML Schema, XSLT și Schematron — <b class="+ topic/ph hi-d/b ">Explain Code</b>, <b class="+ topic/ph hi-d/b ">Chat About Code</b>, <b class="+ topic/ph hi-d/b ">Document Code</b>, <b class="+ topic/ph hi-d/b ">Annotate Code</b>, <b class="+ topic/ph hi-d/b ">Generate Code</b> și <b class="+ topic/ph hi-d/b ">Suggest Refactoring</b>, și vom prezenta exemple despre cum acestea cresc productivitatea la lucrul cu XSLT.

source: <b class="+ topic/ph hi-d/b ">Watch the video demonstration:</b> <xref href="https://youtu.be/s7fppQS0w_c?si=EeNjOPutx04WmhzF###AMP###t=377" scope="external" class="- topic/xref " format="html"> Using AI for XML Development in Oxygen XML Editor </xref>
ro: <b class="+ topic/ph hi-d/b ">Urmăriți demonstrația video:</b> <xref href="https://youtu.be/s7fppQS0w_c?si=EeNjOPutx04WmhzF###AMP###t=377" scope="external" class="- topic/xref " format="html"> Utilizarea AI pentru dezvoltare XML în Oxygen XML Editor </xref>

source: AI-Powered Code Actions Overview
ro: Prezentare generală a acțiunilor de cod bazate pe AI

source: AI Positron integrates smoothly with Oxygen XML Editor/Developer to improve code quality, enhance understanding, and automate repetitive development tasks. Here’s an overview of the main capabilities and their practical benefits for each AI-assisted development action:
ro: AI Positron se integrează perfect cu Oxygen XML Editor/Developer pentru a îmbunătăți calitatea codului, a facilita înțelegerea și a automatiza sarcinile repetitive de dezvoltare. Iată o prezentare a principalelor capabilități și a beneficiilor practice pentru fiecare acțiune de dezvoltare asistată de AI:

source: Select any code fragment or place your cursor inside an element and AI Positron will immediately generate an explanation. This helps you quickly understand legacy XSLT templates, Schematron rules, or complex schema definitions, reducing time spent deciphering unfamiliar code.
ro: Selectați orice fragment de cod sau plasați cursorul într-un element, iar AI Positron va genera imediat o explicație. Acest lucru vă ajută să înțelegeți rapid șabloane XSLT vechi, reguli Schematron sau definiții complexe de schemă, reducând timpul petrecut pentru a descifra cod necunoscut.

source: Start an interactive chat with the AI about the selected code. Ask questions like "What’s the purpose of this constraint?" or "How can I optimize this template?" to brainstorm improvements, resolve technical issues, and make informed changes faster.
ro: Porniți o conversație interactivă cu AI-ul despre codul selectat. Puneți întrebări precum „Care este scopul acestei constrângeri?” sau „Cum pot optimiza acest șablon?” pentru a genera idei de îmbunătățire, a rezolva probleme tehnice și a face modificări informate mai rapid.

source: With a single action, generate clear and concise XML comments for selected XSLT, XML Schema, or Schematron code. These summaries, added before the code block make onboarding, code reviews, and future maintenance easier.
ro: Cu o singură acțiune, generați comentarii XML clare și concise pentru codul XSLT, XML Schema sau Schematron selectat. Aceste rezumate, adăugate înaintea blocului de cod, facilitează onboarding-ul, reviziile de cod și mentenanța ulterioară.

source: Automatically add comments to entire documents or specific elements. The generated annotations clarify intent, constraints, and relationships, streamlining documentation and sharing knowledgeacross your team.
ro: Adăugați automat comentarii la documente întregi sau la elemente specifice. Anotările generate clarifică intenția, constrângerile și relațiile, simplificând documentarea și partajarea cunoștințelor în echipă.

source: Describe the code or transformation you need and let AI Positron create XSLT templates, Schematron assertions, XSD complex types, or JSON Schema objects. The AI reuses existing components where possible, supporting DRY (don't repeat yourself) principles and speeds up the development process.
ro: Descrieți codul sau transformarea de care aveți nevoie și lăsați AI Positron să creeze șabloane XSLT, aserțiuni Schematron, tipuri complexe XSD sau obiecte JSON Schema. AI-ul reutilizează componente existente acolo unde este posibil, respectând principiile DRY (don't repeat yourself) și accelerează procesul de dezvoltare.

source: Receive suggestions to simplify code and improve modularity.The AI can upgrade the XSLT version, split large templates, extract reusable code, or add clarifying comments. Refactoring helps you modernize and maintain code with less effort.
ro: Primiți sugestii pentru simplificarea codului și îmbunătățirea modularității. AI-ul poate actualiza versiunea XSLT, poate împărți șabloane mari, extrage cod reutilizabil sau adăuga comentarii explicative. Refactorizarea vă ajută să modernizați și să mențineți codul cu mai puțin efort.

source: Practical Example: Accelerate XSLT Development with AI Actions
ro: Exemplu practic: accelerați dezvoltarea XSLT cu acțiuni AI

source: As an XSLT developer, you can significantly speed up your workflow and improve code quality using the AI Positron add-on in Oxygen XML Editor. Here’s an example showing how to use AI actions with real XSLT code:
ro: Ca dezvoltator XSLT, vă puteți accelera semnificativ fluxul de lucru și îmbunătăți calitatea codului folosind suplimentul AI Positron în Oxygen XML Editor. Iată un exemplu care arată cum să utilizați acțiunile AI cu cod XSLT real:

source: <b class="+ topic/ph hi-d/b ">Understand Existing Templates with <i class="+ topic/ph hi-d/i ">Explain Code</i></b> - Suppose you encounter the following template:
ro: <b class="+ topic/ph hi-d/b ">Înțelegeți șabloanele existente cu <i class="+ topic/ph hi-d/i ">Explain Code</i></b> - Să presupunem că întâlniți următorul șablon:

source: Select this code and use the <b class="+ topic/ph hi-d/b ">Explain Code</b> action. The AI will output:
ro: Selectați acest cod și folosiți acțiunea <b class="+ topic/ph hi-d/b ">Explain Code</b>. AI-ul va genera următoarea explicație:

source: This template matches <codeph class="+ topic/ph pr-d/codeph "><section></codeph> elements, creates a <codeph class="+ topic/ph pr-d/codeph "><div></codeph> with class "section", outputs the section title in an <codeph class="+ topic/ph pr-d/codeph "><h2></codeph>, and applies templates to all <codeph class="+ topic/ph pr-d/codeph "><para></codeph> children.
ro: Acest șablon se potrivește elementelor <codeph class="+ topic/ph pr-d/codeph "><section></codeph>, creează un <codeph class="+ topic/ph pr-d/codeph "><div></codeph> cu clasa "section", afișează titlul secțiunii într-un <codeph class="+ topic/ph pr-d/codeph "><h2></codeph> și aplică șabloane tuturor copiilor <codeph class="+ topic/ph pr-d/codeph "><para></codeph>.

source: <b class="+ topic/ph hi-d/b ">Discuss and Improve Code with <i class="+ topic/ph hi-d/i ">Chat About Code</i></b> - If you want to optimize or extend the previous template, select it and use the <b class="+ topic/ph hi-d/b ">Chat About Code</b> action. For example, you might ask:
ro: <b class="+ topic/ph hi-d/b ">Discuții și îmbunătățiri cu <i class="+ topic/ph hi-d/i ">Chat About Code</i></b> - Dacă doriți să optimizați sau să extindeți șablonul anterior, selectați-l și folosiți acțiunea <b class="+ topic/ph hi-d/b ">Chat About Code</b>. De exemplu, puteți întreba:

source: How can I add a check to display a warning if the section has no title?
ro: Cum pot adăuga o verificare pentru a afișa un avertisment dacă secțiunea nu are titlu?

source: The AI suggested:
ro: AI-ul a sugerat:

source: <b class="+ topic/ph hi-d/b ">Document Templates with <i class="+ topic/ph hi-d/i ">Document Code</i></b> - To help with future maintenance, select the previous updated template and use the <b class="+ topic/ph hi-d/b ">Document Code</b> action. The AI will insert a comment before the template:
ro: <b class="+ topic/ph hi-d/b ">Documentați șabloanele cu <i class="+ topic/ph hi-d/i ">Document Code</i></b> - Pentru a facilita mentenanța viitoare, selectați șablonul actualizat anterior și folosiți acțiunea <b class="+ topic/ph hi-d/b ">Document Code</b>. AI-ul va insera un comentariu înaintea șablonului:

source: <!-- Outputs each section as a div with its title in an h2 header. Issues a warning placeholder when the title is missing and continues processing paragraphs. --> <xsl:template match="section"> [...] </xsl:template>
ro: <!-- Afișează fiecare secțiune ca un div cu titlul în antetul h2. Inserează un placeholder de avertisment când lipsește titlul și continuă procesarea paragrafelor. --> <xsl:template match="section"> [...] </xsl:template>

source: <b class="+ topic/ph hi-d/b ">Annotate Intricate Logic with <i class="+ topic/ph hi-d/i ">Annotate Code</i></b> - For complex templates, use the <b class="+ topic/ph hi-d/b ">Annotate Code</b> action to insert both template documentation and inline comments, all comments in this example were generated by AI:
ro: <b class="+ topic/ph hi-d/b ">Anotați logica complexă cu <i class="+ topic/ph hi-d/i ">Annotate Code</i></b> - Pentru șabloane complexe, folosiți acțiunea <b class="+ topic/ph hi-d/b ">Annotate Code</b> pentru a insera atât documentație pentru șablon, cât și comentarii inline; toate comentariile din acest exemplu au fost generate de AI:

source: <u class="+ topic/ph hi-d/u "><!-- Template that matches the "book" element in the input XML and transforms it into HTML. The structure includes a main <div> containing the book's title and all chapters with their sections. --></u> <xsl:template match="book"> <div> <u class="+ topic/ph hi-d/u "><!-- Output the book's title inside an <h1> tag --></u> <h1> <xsl:value-of select="title"/> </h1> <u class="+ topic/ph hi-d/u "><!-- Iterate over each "chapter" child element of "book" --></u> <xsl:for-each select="chapter"> <u class="+ topic/ph hi-d/u "><!-- Output the chapter's title inside an <h2> tag --></u> <h2> <xsl:value-of select="title"/> </h2> <u class="+ topic/ph hi-d/u "><!-- Apply templates to all "section" elements within the current chapter. This allows further processing of sections by other templates. --></u> <xsl:apply-templates select="section"/> </xsl:for-each> </div> </xsl:template>
ro: <u class="+ topic/ph hi-d/u "><!-- Șablon care se potrivește elementului "book" din XML-ul de intrare și îl transformă în HTML. Structura include un <div> principal care conține titlul cărții și toate capitolele cu secțiunile lor. --></u> <xsl:template match="book"> <div> <u class="+ topic/ph hi-d/u "><!-- Afișează titlul cărții într-un tag <h1> --></u> <h1> <xsl:value-of select="title"/> </h1> <u class="+ topic/ph hi-d/u "><!-- Iterează peste fiecare element "chapter" copil al "book" --></u> <xsl:for-each select="chapter"> <u class="+ topic/ph hi-d/u "><!-- Afișează titlul capitolului într-un tag <h2> --></u> <h2> <xsl:value-of select="title"/> </h2> <u class="+ topic/ph hi-d/u "><!-- Aplică șabloane tuturor elementelor "section" din capitolul curent. Acest lucru permite procesarea suplimentară a secțiunilor de către alte șabloane. --></u> <xsl:apply-templates select="section"/> </xsl:for-each> </div> </xsl:template>

source: <b class="+ topic/ph hi-d/b ">Generate New Templates with <i class="+ topic/ph hi-d/i ">Generate Code</i></b> - Place your cursor after a comment that describes the desired functionality and use the <b class="+ topic/ph hi-d/b ">Generate Code</b> action:
ro: <b class="+ topic/ph hi-d/b ">Generați șabloane noi cu <i class="+ topic/ph hi-d/i ">Generate Code</i></b> - Plasați cursorul după un comentariu care descrie funcționalitatea dorită și folosiți acțiunea <b class="+ topic/ph hi-d/b ">Generate Code</b>:

source: <!-- Generate a template that outputs all author names in a comma-separated list -->
ro: <!-- Generați un șablon care afișează toate numele autorilor într-o listă separată prin virgulă -->

source: The AI generates:
ro: AI-ul generează:

source: <b class="+ topic/ph hi-d/b ">Refactor Complex Code with <i class="+ topic/ph hi-d/i ">Suggest Refactoring</i></b> - If you have a monolithic template such as:
ro: <b class="+ topic/ph hi-d/b ">Refactorizați codul complex cu <i class="+ topic/ph hi-d/i ">Suggest Refactoring</i></b> - Dacă aveți un șablon monolitic precum:

source: This template processes the entire book structure in a single, nested template using <xsl:for-each> for chapters and <xsl:apply-templates> for sections. While this works, it can become difficult to maintain, extend, or debug as the complexity of the XML structure grows.
ro: Acest șablon procesează întreaga structură a cărții într-un singur șablon imbricat, folosind <xsl:for-each> pentru capitole și <xsl:apply-templates> pentru secțiuni. Deși funcționează, poate deveni dificil de întreținut, extins sau depanat pe măsură ce structura XML devine mai complexă.

source: Use the <b class="+ topic/ph hi-d/b ">Suggest Refactoring</b> action and the AI will suggest to break it into smaller templates:
ro: Rulați acțiunea <b class="+ topic/ph hi-d/b ">Suggest Refactoring</b>, iar AI-ul va sugera împărțirea în șabloane mai mici:

source: <xsl:template match="book"> <div> <h1> <xsl:value-of select="title"/> </h1> <xsl:apply-templates select="chapter"/> </div> </xsl:template> <xsl:template match="chapter"> <h2> <xsl:value-of select="title"/> </h2> <xsl:apply-templates select="section"/> </xsl:template> <xsl:template match="section"> <h3> <xsl:value-of select="title"/> </h3> <!-- Add more processing for section content here if needed --> </xsl:template>
ro: <xsl:template match="book"> <div> <h1> <xsl:value-of select="title"/> </h1> <xsl:apply-templates select="chapter"/> </div> </xsl:template> <xsl:template match="chapter"> <h2> <xsl:value-of select="title"/> </h2> <xsl:apply-templates select="section"/> </xsl:template> <xsl:template match="section"> <h3> <xsl:value-of select="title"/> </h3> <!-- Adăugați aici procesarea suplimentară pentru conținutul secțiunii, dacă este necesar --> </xsl:template>

source: By breaking the logic into separate templates for <book>, <chapter>, and <section>, each template is focused on a single responsibility. This modular approach makes it easier to understand what each part of the code is doing, and to locate or update specific logic.
ro: Prin împărțirea logicii în șabloane separate pentru <book>, <chapter> și <section>, fiecare șablon se concentrează pe o singură responsabilitate. Această abordare modulară face mai ușor de înțeles ce face fiecare parte a codului și de localizat sau actualizat logica specifică.

source: <b class="+ topic/ph hi-d/b ">Summary:</b> With these AI-powered actions, you can quickly understand, document, generate, refactor, and annotate XSLT code, making your XSLT development process faster and your stylesheets easier to maintain. For more hands-on examples, see the <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Code%20Development" scope="external" class="- topic/xref " format="html">AI Positron Assistant samples on GitHub</xref>.
ro: <b class="+ topic/ph hi-d/b ">Rezumat:</b> Cu aceste acțiuni bazate pe AI, puteți înțelege rapid, documenta, genera, refactoriza și anota codul XSLT, făcând procesul de dezvoltare XSLT mai rapid și foile de stil mai ușor de întreținut. Pentru mai multe exemple practice, consultați <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Code%20Development" scope="external" class="- topic/xref " format="html">exemplele AI Positron Assistant pe GitHub</xref>.

source: Creating a Custom AI Action
ro: Crearea unei acțiuni AI personalizate

source: For advanced automation and customized workflows, <b class="+ topic/ph hi-d/b ">Oxygen</b> lets you build and integrate custom AI actions directly into your workspace. These actions extend Oxygen’s standard tools and give you greater flexibility and control over AI-driven tasks.
ro: Pentru automatizări avansate și fluxuri de lucru personalizate, <b class="+ topic/ph hi-d/b ">Oxygen</b> vă permite să construiți și să integrați acțiuni AI personalizate direct în spațiul dvs. de lucru. Aceste acțiuni extind instrumentele standard Oxygen și vă oferă flexibilitate și control sporit asupra sarcinilor bazate pe AI.
