Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: Ready to integrate AI into your XML workflow? Activate these options in Oxygen XML Editor and start making your content more consistent, compliant, and future-ready today.
ro: Sunteți gata să integrați AI în fluxul dumneavoastră XML? Activați aceste opțiuni în Oxygen XML Editor și începeți să vă faceți conținutul mai consecvent, conform și pregătit pentru viitor chiar de astăzi.

source: AI Positron XPath Extension Functions
ro: Funcții de extensie XPath AI Positron

source: AI XPath Extension Functions Options
ro: Opțiuni pentru funcțiile de extensie XPath AI

source: XPath AI Extension Functions Explained
ro: Explicații pentru funcțiile de extensie XPath AI

source: Creating Custom AI Actions for the AI Positron add-on
ro: Crearea acțiunilor AI personalizate pentru suplimentul AI Positron

source: In the <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/actions_preferences.html" scope="external" class="- topic/xref " format="html">AI Positron Assistant preferences page</xref>, you can define a reference to a folder that contains custom actions.
ro: În pagina de preferințe <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/actions_preferences.html" scope="external" class="- topic/xref " format="html">AI Positron Assistant</xref>, puteți defini o referință către un folder care conține acțiuni personalizate.

source: Once the add-on is installed, the New Document wizard can be used to create either a new <b class="+ topic/ph hi-d/b ">AI Positron Custom Action</b> file that contains a custom action definition in JSON format or an <b class="+ topic/ph hi-d/b ">AI Positron Custom Actions List</b> that contains a JSON array with multiple defined actions. Validation and content completion are automatically provided for such custom action files. To edit multi-line parameter values, you can switch the edited action JSON definition file to the <b class="+ topic/ph hi-d/b ">Author</b> visual editor mode.
ro: După instalarea suplimentului, expertul New Document poate fi folosit pentru a crea fie un fișier <b class="+ topic/ph hi-d/b ">AI Positron Custom Action</b> nou, care conține o definiție de acțiune personalizată în format JSON, fie o <b class="+ topic/ph hi-d/b ">AI Positron Custom Actions List</b> care conține un array JSON cu mai multe acțiuni definite. Pentru astfel de fișiere de acțiuni personalizate, validarea și completarea de conținut sunt oferite automat. Pentru a edita valori de parametri pe mai multe linii, puteți comuta fișierul JSON de definiție a acțiunii editate în modul vizual <b class="+ topic/ph hi-d/b ">Author</b>.

source: If the action definition files are saved in the custom actions folder defined in the AI Positron Assistant preferences page, the AI Positron Assistant view should automatically reload its Actions list to include them.
ro: Dacă fișierele de definiție a acțiunilor sunt salvate în folderul de acțiuni personalizate definit în pagina de preferințe AI Positron Assistant, vizualizarea AI Positron Assistant ar trebui să reîncarce automat lista de acțiuni pentru a le include.

source: Various examples of custom AI actions can be found <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Custom%20Actions" scope="external" class="- topic/xref " format="html">here</xref> and can be used as starting points for your own similar AI actions.
ro: Diverse exemple de acțiuni AI personalizate pot fi găsite <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Custom%20Actions" scope="external" class="- topic/xref " format="html">aici</xref> și pot fi folosite ca puncte de pornire pentru propriile acțiuni AI similare.

source: An AI action definition may contain the following properties:
ro: O definiție de acțiune AI poate conține următoarele proprietăți:

source: A unique ID for the action. If the ID of the action starts with <codeph class="+ topic/ph pr-d/codeph ">agent.hidden.action.</codeph>, then the action is not visible to be invoked directly but can be called by using the <codeph class="+ topic/ph pr-d/codeph ">invoke_ai_action(actionID, content)</codeph> function.
ro: Un ID unic pentru acțiune. Dacă ID-ul acțiunii începe cu <codeph class="+ topic/ph pr-d/codeph ">agent.hidden.action.</codeph>, atunci acțiunea nu este vizibilă pentru a fi invocată direct, dar poate fi apelată folosind funcția <codeph class="+ topic/ph pr-d/codeph ">invoke_ai_action(actionID, content)</codeph>.

source: Example:
ro: Exemplu:

source: An Oxygen desktop plugin can contribute an extra <xref href="https://www.oxygenxml.com/doc/ug-editor/dev_guide/contributing_translations_for_new_labels_and_ui_text.html" scope="external" class="- topic/xref " format="html"><filepath class="+ topic/ph sw-d/filepath ">translation.xml</filepath></xref> file that contains translations. Such a plugin may translate titles and descriptions for AI actions using the action ID as part of the key.
ro: Un plugin desktop Oxygen poate contribui cu un fișier suplimentar <xref href="https://www.oxygenxml.com/doc/ug-editor/dev_guide/contributing_translations_for_new_labels_and_ui_text.html" scope="external" class="- topic/xref " format="html"><filepath class="+ topic/ph sw-d/filepath ">translation.xml</filepath></xref> care conține traduceri. Un astfel de plugin poate traduce titluri și descrieri pentru acțiuni AI folosind ID-ul acțiunii ca parte a cheii.

source: Example:
ro: Exemplu:

source: The action name/title that gets presented in the UI.
ro: Numele/titlul acțiunii care este afișat în interfața utilizatorului.

source: Example:
ro: Exemplu:

source: A longer description of what the AI action does, usually used as a tooltip.
ro: O descriere mai lungă a ceea ce face acțiunea AI, folosită de obicei ca tooltip.

source: Example:
ro: Exemplu:

source: A shorter description for the AI action that usually appears under the action title in the chat view. If not specified, it defaults to the description value.
ro: O descriere mai scurtă pentru acțiunea AI, care apare de obicei sub titlul acțiunii în vizualizarea de chat. Dacă nu este specificată, se folosește valoarea din description.

source: Example:
ro: Exemplu:

source: The optional category in which the AI action is visually grouped, if not specified it defaults to <codeph class="+ topic/ph pr-d/codeph ">Other</codeph>.
ro: Categoria opțională în care acțiunea AI este grupată vizual; dacă nu este specificată, valoarea implicită este <codeph class="+ topic/ph pr-d/codeph ">Other</codeph>.

source: Example:
ro: Exemplu:

source: A framework pattern (like '<codeph class="+ topic/ph pr-d/codeph ">DITA*</codeph>') or content type name (like '<codeph class="+ topic/ph pr-d/codeph ">text/css</codeph>') that, when matched, presents the action when the document belonging to the framework is opened.
ro: Un pattern de framework (precum '<codeph class="+ topic/ph pr-d/codeph ">DITA*</codeph>') sau un nume de tip de conținut (precum '<codeph class="+ topic/ph pr-d/codeph ">text/css</codeph>') care, atunci când se potrivește, afișează acțiunea când documentul aparținând framework-ului este deschis.

source: Example:
ro: Exemplu:

source: An example of an AI action that shows this for any edited XML document (as it matches the <codeph class="+ topic/ph pr-d/codeph ">text/xml</codeph> content type) can be found <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/formula-equation.json" scope="external" class="- topic/xref " format="html">here</xref>.
ro: Un exemplu de acțiune AI care afișează acest lucru pentru orice document XML editat (deoarece se potrivește cu tipul de conținut <codeph class="+ topic/ph pr-d/codeph ">text/xml</codeph>) poate fi găsit <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/formula-equation.json" scope="external" class="- topic/xref " format="html">aici</xref>.

source: A reference to a separate file (usually encoded in Markdown) which defines the entire action prompt.
ro: O referință către un fișier separat (de obicei codificat în Markdown) care definește întregul prompt al acțiunii.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/update-title.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/update-title.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: The prompt is the most important part of the AI action. A prompt must be as precise and detailed as possible, including examples. Some companies may adopt prompt methodologies like <uicontrol class="+ topic/ph ui-d/uicontrol ">COSTAR</uicontrol> to specify the prompt value. The context prompt defined in the Oxygen AI Positron Preferences page is used as a prefix for all AI action prompts.
ro: Promptul este cea mai importantă parte a acțiunii AI. Un prompt trebuie să fie cât mai precis și detaliat posibil, incluzând exemple. Unele companii pot adopta metodologii de prompt precum <uicontrol class="+ topic/ph ui-d/uicontrol ">COSTAR</uicontrol> pentru a specifica valoarea promptului. Promptul de context definit în pagina de preferințe Oxygen AI Positron este folosit ca prefix pentru toate prompturile acțiunilor AI.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/prompts/convert-dita-type.md" scope="external" class="- topic/xref " format="html">Here is an example of a large prompt file</xref>.
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/prompts/convert-dita-type.md" scope="external" class="- topic/xref " format="html">Aici este un exemplu de fișier prompt mare</xref>.

source: A custom AI action can expand the context prompt in a specific part of its prompt by using the <codeph class="+ topic/ph pr-d/codeph ">${contextPrompt}</codeph> variable in its own prompt.
ro: O acțiune AI personalizată poate extinde promptul de context într-o anumită parte a promptului său folosind variabila <codeph class="+ topic/ph pr-d/codeph ">${contextPrompt}</codeph> în propriul prompt.

source: To define a custom AI action that does not use the context prompt in any way, in the AI action's JSON configuration file, you can expand the context prompt to an empty value like this:
ro: Pentru a defini o acțiune AI personalizată care nu folosește deloc promptul de context, în fișierul de configurare JSON al acțiunii AI, puteți extinde promptul de context la o valoare goală astfel:

source: Multi-line parameter value that defines inline the prompt that is sent to the AI along with the content to be processed.
ro: Valoare de parametru pe mai multe linii care definește inline promptul trimis către AI împreună cu conținutul ce trebuie procesat.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/review-logical-mistakes.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/review-logical-mistakes.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: The prompt is the most important part of the AI action. A prompt must be as precise and detailed as possible, including examples. Some companies may adopt prompt methodologies like <uicontrol class="+ topic/ph ui-d/uicontrol ">COSTAR</uicontrol> to specify the prompt value. The context prompt defined in the Oxygen AI Positron Preferences page is used as a prefix for all AI action prompts.
ro: Promptul este cea mai importantă parte a acțiunii AI. Un prompt trebuie să fie cât mai precis și detaliat posibil, incluzând exemple. Unele companii pot adopta metodologii de prompt precum <uicontrol class="+ topic/ph ui-d/uicontrol ">COSTAR</uicontrol> pentru a specifica valoarea promptului. Promptul de context definit în pagina de preferințe Oxygen AI Positron este folosit ca prefix pentru toate prompturile acțiunilor AI.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/prompts/convert-dita-type.md" scope="external" class="- topic/xref " format="html">Here is an example of a large prompt file</xref>.
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/prompts/convert-dita-type.md" scope="external" class="- topic/xref " format="html">Aici este un exemplu de fișier prompt mare</xref>.

source: A custom AI action can expand the context prompt in a specific part of its prompt by using the <codeph class="+ topic/ph pr-d/codeph ">${contextPrompt}</codeph> variable in its own prompt.
ro: O acțiune AI personalizată poate extinde promptul de context într-o anumită parte a promptului său folosind variabila <codeph class="+ topic/ph pr-d/codeph ">${contextPrompt}</codeph> în propriul prompt.

source: To define a custom AI action that does not use the context prompt in any way, in the AI action's JSON configuration file, you can expand the context prompt to an empty value like this:
ro: Pentru a defini o acțiune AI personalizată care nu folosește deloc promptul de context, în fișierul de configurare JSON al acțiunii AI, puteți extinde promptul de context la o valoare goală astfel:

source: A JSON array that can define values for parameters that should be expanded in the context content.
ro: Un array JSON care poate defini valori pentru parametri ce trebuie extinși în conținutul de context.

source: You can define parameters that can be configured by the end user when hovering over the AI action in the UI.
ro: Puteți defini parametri care pot fi configurați de utilizatorul final atunci când trece cu mouse-ul peste acțiunea AI în interfață.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/Thesaurus.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/Thesaurus.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: The following properties are available for a defined parameter:
ro: Următoarele proprietăți sunt disponibile pentru un parametru definit:

source: The parameter name. It can be referenced multiple times with the syntax <codeph class="+ topic/ph pr-d/codeph ">${param_name}</codeph> in the <codeph class="+ topic/ph pr-d/codeph ">context</codeph> parameter or in the external prompt file referenced using <codeph class="+ topic/ph pr-d/codeph ">prompt_ref</codeph>.
ro: Numele parametrului. Poate fi referențiat de mai multe ori cu sintaxa <codeph class="+ topic/ph pr-d/codeph ">${param_name}</codeph> în parametrul <codeph class="+ topic/ph pr-d/codeph ">context</codeph> sau în fișierul prompt extern referențiat prin <codeph class="+ topic/ph pr-d/codeph ">prompt_ref</codeph>.

source: The label that appears in the UI when the parameter's value is configured by the end user.
ro: Eticheta care apare în interfață atunci când valoarea parametrului este configurată de utilizatorul final.

source: The value of the parameter. It can contain various <xref href="https://www.oxygenxml.com/doc/ug-editor/topics/editor-variables.html" scope="external" class="- topic/xref " format="html">editor variables</xref> that get automatically expanded.
ro: Valoarea parametrului. Poate conține diverse <xref href="https://www.oxygenxml.com/doc/ug-editor/topics/editor-variables.html" scope="external" class="- topic/xref " format="html">variabile de editor</xref> care sunt expandate automat.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/update-prolog.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/update-prolog.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: An optional array of alternate values that are available to be configured by the end user when hovering over the AI action.
ro: Un array opțional de valori alternative care pot fi configurate de utilizatorul final atunci când trece cu mouse-ul peste acțiunea AI.

source: An optional choice type that defines how the end user can configure the alternate values (combo box, check boxes, radio buttons).
ro: Un tip de alegere opțional care definește modul în care utilizatorul final poate configura valorile alternative (combo box, check box-uri, butoane radio).

source: The optional prefix value to be used for each expansion of the parameter's value.
ro: Valoarea opțională de prefix care va fi folosită la fiecare extindere a valorii parametrului.

source: An array of parameters that can be used to specify an engine name, temperature, or the available function definitions. Some of the most commonly set parameters:
ro: Un array de parametri care pot fi folosiți pentru a specifica un nume de motor, temperatura sau definițiile funcțiilor disponibile. Câțiva dintre cei mai des folosiți parametri:

source: The optional name of the engine to use with the AI action, no matter what the default AI engine model is configured to be.
ro: Numele opțional al motorului care va fi folosit cu acțiunea AI, indiferent de modelul AI implicit configurat.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/review-logical-mistakes.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/review-logical-mistakes.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: Temperature is an optional parameter that governs the randomness and thus the creativity of the responses. It is always a number between 0 (more deterministic) and 1 (more random). The default value is 0 and it should, in general, remain unspecified when your AI actions are intended for technical documentation that is precise in nature.
ro: Temperatura este un parametru opțional care guvernează gradul de aleatoriu și, implicit, creativitatea răspunsurilor. Este întotdeauna un număr între 0 (mai determinist) și 1 (mai aleatoriu). Valoarea implicită este 0 și, în general, ar trebui să rămână nespecificată atunci când acțiunile AI sunt destinate documentației tehnice de natură precisă.

source: An optional JSON array that describes which functions can be used when executing this action.
ro: Un array JSON opțional care descrie ce funcții pot fi folosite la executarea acestei acțiuni.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/add-related-links.json" scope="external" class="- topic/xref " format="html">Example</xref> of an AI action that uses <uicontrol class="+ topic/ph ui-d/uicontrol ">Retrieval Augmented Generation (RAG)</uicontrol> functions to find related content in the project:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/add-related-links.json" scope="external" class="- topic/xref " format="html">Exemplu</xref> de acțiune AI care folosește funcții <uicontrol class="+ topic/ph ui-d/uicontrol ">Retrieval Augmented Generation (RAG)</uicontrol> pentru a găsi conținut relevant în proiect:

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/get-content-from-website.json" scope="external" class="- topic/xref " format="html">Example</xref> of an AI action that uses the <codeph class="+ topic/ph pr-d/codeph ">get_content_for_document_url</codeph> function to retrieve content from a web site:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/get-content-from-website.json" scope="external" class="- topic/xref " format="html">Exemplu</xref> de acțiune AI care folosește funcția <codeph class="+ topic/ph pr-d/codeph ">get_content_for_document_url</codeph> pentru a prelua conținut de pe un site web:

source: There are specific actions that can be called to invoke other AI actions from an AI action, thus creating an agenting mechanism where various parts of the work is done by various actions. An example can be found <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/ai-actions-composed.json" scope="external" class="- topic/xref " format="html">here</xref>.
ro: Există acțiuni specifice care pot fi apelate pentru a invoca alte acțiuni AI dintr-o acțiune AI, creând astfel un mecanism de agentizare unde diverse părți ale lucrului sunt realizate de diverse acțiuni. Un exemplu poate fi găsit <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/ai-actions-composed.json" scope="external" class="- topic/xref " format="html">aici</xref>.

source: Defines which part of the current document should be sent to be processed by the AI engine.
ro: Definește ce parte din documentul curent trebuie trimisă pentru a fi procesată de motorul AI.

source: selection, document [default]
ro: selection, document [implicit]

source: Prefers sending the selected content. If there is no selection, it selects and sends the entire document.
ro: Preferă trimiterea conținutului selectat. Dacă nu există selecție, selectează și trimite întregul document.

source: Prefers sending the selected content. If no content is selected, either no content is sent or an error message is received (depending on the action's <codeph class="+ topic/ph pr-d/codeph ">output-action</codeph>).
ro: Preferă trimiterea conținutului selectat. Dacă nu este selectat niciun conținut, fie nu se trimite nimic, fie se primește un mesaj de eroare (în funcție de <codeph class="+ topic/ph pr-d/codeph ">output-action</codeph> al acțiunii).

source: Always sends the entire document for processing, regardless if there is content selected inside it.
ro: Trimite întotdeauna întregul document pentru procesare, indiferent dacă există conținut selectat în interiorul acestuia.

source: Does not send any content from the current document. See this <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/revised-action-format-properties/Custom%20Actions/formula-equation.json" scope="external" class="- topic/xref " format="html">example</xref>.
ro: Nu trimite niciun conținut din documentul curent. Vezi acest <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/revised-action-format-properties/Custom%20Actions/formula-equation.json" scope="external" class="- topic/xref " format="html">exemplu</xref>.
