Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: The <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/preferences.html#preferences__dlentry_afh_cck_sfd" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">Context prompt</b></xref> text area in the <b class="+ topic/ph hi-d/b ">AI Positron Assistant</b> preferences page can also contain rules for the most important terms and disallowed synonyms.
ro: Zona de text <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/preferences.html#preferences__dlentry_afh_cck_sfd" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">Context prompt</b></xref> din pagina de preferințe <b class="+ topic/ph hi-d/b ">AI Positron Assistant</b> poate conține și reguli pentru cei mai importanți termeni și sinonimele interzise.

source: Example of context that establishes some of the most important terms:
ro: Exemplu de context care stabilește unii dintre cei mai importanți termeni:

source: # Terminology Specific terms in the DITA XML content must be wrapped in the <term> element. Preserve all such terms and do not attempt to replace them with possible synonyms. Always prefer to use the terms below instead of possible synonyms: ``` Sharkfin Rover (instead of 'Sharkfin Buggy') vehicle (instead of 'car') lorry (instead of 'truck') rear position lamp (instead of 'tailgate') powertrain (instead of 'drivetrain') petrol engine (instead of 'Otto engine') motorcycle (instead of 'motor-bike') engine (instead of 'motor') electronic stability control (instead of 'ESP') motor vehicle chassis (instead of 'vehicle frame') ```
ro: # Terminologie Termenii specifici din conținutul DITA XML trebuie marcați cu elementul <term>. Păstrați toți acești termeni și nu încercați să îi înlocuiți cu posibili sinonimi. Se va prefera întotdeauna utilizarea termenilor de mai jos în locul posibilelor sinonime: ``` Sharkfin Rover (în loc de 'Sharkfin Buggy') vehicle (în loc de 'car') lorry (în loc de 'truck') rear position lamp (în loc de 'tailgate') powertrain (în loc de 'drivetrain') petrol engine (în loc de 'Otto engine') motorcycle (în loc de 'motor-bike') engine (în loc de 'motor') electronic stability control (în loc de 'ESP') motor vehicle chassis (în loc de 'vehicle frame') ```

source: Once the AI model receives the imposed terminology rules as part of the prompt context, it will take them into account for all interactions (e.g. for creating documentation drafts from content that was written without taking the terminology into account).
ro: Odată ce modelul AI primește regulile de terminologie impuse ca parte a contextului prompt, le va lua în considerare pentru toate interacțiunile (de exemplu, pentru crearea de schițe de documentație din conținut scris fără respectarea terminologiei).

source: The Oxygen <xref href="https://www.oxygenxml.com/doc/ug-addons/topics/terminology-checker-addon.html" scope="external" class="- topic/xref " format="html">Terminology Checker add-on</xref> can be configured with a terminology rules file that allows it to highlight terminology problems in real time and propose replacement for them. You can find a sample terminology rules file <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/oxygen-term-checker/terms.xml" scope="external" class="- topic/xref " format="html">here</xref>. There is also a <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/create-term-checker-rules.json" scope="external" class="- topic/xref " format="html">sample AI action</xref> that can generate an XML rules file from the add-on based on a style guide.
ro: Suplimentul <xref href="https://www.oxygenxml.com/doc/ug-addons/topics/terminology-checker-addon.html" scope="external" class="- topic/xref " format="html">Terminology Checker</xref> din Oxygen poate fi configurat cu un fișier de reguli de terminologie care permite evidențierea în timp real a problemelor de terminologie și propunerea de înlocuiri pentru acestea. Un exemplu de fișier de reguli de terminologie poate fi găsit <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/oxygen-term-checker/terms.xml" scope="external" class="- topic/xref " format="html">aici</xref>. Există și o <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/create-term-checker-rules.json" scope="external" class="- topic/xref " format="html">acțiune AI exemplu</xref> care poate genera un fișier de reguli XML din supliment, pe baza unui ghid de stil.

source: Once the <b class="+ topic/ph hi-d/b ">Terminology Checker</b> add-on is installed and flags the terminology problems in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Author</uicontrol> visual editor mode, you can use the <uicontrol class="+ topic/ph ui-d/uicontrol ">Fix Terminology Problems</uicontrol> AI action to fix terminology problems in the currently opened topic's contents.
ro: Odată ce suplimentul <b class="+ topic/ph hi-d/b ">Terminology Checker</b> este instalat și semnalează problemele de terminologie în modul vizual <uicontrol class="+ topic/ph ui-d/uicontrol ">Author</uicontrol>, puteți folosi acțiunea AI <uicontrol class="+ topic/ph ui-d/uicontrol ">Fix Terminology Problems</uicontrol> pentru a corecta problemele de terminologie din conținutul topicului deschis.

source: As a conclusion, you can add your most important terminology rules in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Context</uicontrol> setting to create and process DITA XML content while directly obeying the rules. However, installing the terminology checker add-on allows you to see terminology problems highlighted in the visual editor and to fix them using the AI engine with the bundled <uicontrol class="+ topic/ph ui-d/uicontrol ">Fix Terminology Problems</uicontrol> AI action.
ro: În concluzie, puteți adăuga cele mai importante reguli de terminologie în setarea <uicontrol class="+ topic/ph ui-d/uicontrol ">Context</uicontrol> pentru a crea și procesa conținut DITA XML respectând direct regulile. Totuși, instalarea suplimentului terminology checker vă permite să vedeți problemele de terminologie evidențiate în editorul vizual și să le corectați folosind motorul AI cu acțiunea AI inclusă <uicontrol class="+ topic/ph ui-d/uicontrol ">Fix Terminology Problems</uicontrol>.

source: Style Guide
ro: Ghid de stil

source: A style guide is a set of project-specific standards and guidelines used to ensure consistency and clarity in technical documentation. A company's style guide may come in various formats (DITA XML, Markdown, Word, etc.) but some of the most important rules in the style guide can be distilled and set in the <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/preferences.html#preferences__dlentry_afh_cck_sfd" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">Context prompt</b></xref> text area within the <b class="+ topic/ph hi-d/b ">AI Positron Assistant</b> preferences page.
ro: Un ghid de stil este un set de standarde și recomandări specifice proiectului, folosite pentru a asigura coerența și claritatea documentației tehnice. Ghidul de stil al unei companii poate fi în diverse formate (DITA XML, Markdown, Word etc.), dar unele dintre cele mai importante reguli pot fi sintetizate și setate în zona de text <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/preferences.html#preferences__dlentry_afh_cck_sfd" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">Context prompt</b></xref> din pagina de preferințe <b class="+ topic/ph hi-d/b ">AI Positron Assistant</b>.

source: Example of context that establishes some of the most important style guide rules:
ro: Exemplu de context care stabilește unele dintre cele mai importante reguli din ghidul de stil:

source: # Style guide There is a set of company specific Style Guide rules which are important to follow when rewriting or creating new content, the most important rules are mentioned below: - Never use a metaphor, simile, or other figure of speech. - Never use a long word where a short one will do. - Keep sentences short. If it is possible to cut a word out, always cut it out. - Never use the passive where you can use the active. - Never use a foreign phrase, a scientific word, or a jargon word if you can think of an everyday English equivalent. - Don’t use text that points to other topics such as "In the document below" or "in the following section." - Some words or phrases are disallowed to be used. Mapping of disallowed phrases to their valid equivalent constructs: ``` as well as, in addition to => and at this time, at this/that point in time => currently, now/then advance planning => planning by means of => by by reason of => because of due to the fact => because during the course of => during end result => result ```
ro: # Ghid de stil Există un set de reguli din Ghidul de Stil al companiei care sunt importante de urmat la rescrierea sau crearea de conținut nou, cele mai importante reguli sunt menționate mai jos: - Nu folosiți niciodată metafore, comparații sau alte figuri de stil. - Nu folosiți niciodată un cuvânt lung acolo unde este suficient unul scurt. - Păstrați propozițiile scurte. Dacă este posibil să eliminați un cuvânt, eliminați-l întotdeauna. - Nu folosiți niciodată diateza pasivă acolo unde puteți folosi diateza activă. - Nu folosiți niciodată expresii străine, termeni științifici sau jargon dacă puteți găsi un echivalent uzual în limba engleză. - Nu folosiți texte care fac trimitere la alte topicuri, cum ar fi „În documentul de mai jos” sau „în secțiunea următoare”. - Unele cuvinte sau expresii sunt interzise. Maparea expresiilor interzise la variantele lor valide: ``` as well as, in addition to => and at this time, at this/that point in time => currently, now/then advance planning => planning by means of => by by reason of => because of due to the fact => because during the course of => during end result => result ```

source: The Oxygen <xref href="https://www.oxygenxml.com/doc/ug-addons/topics/terminology-checker-addon.html" scope="external" class="- topic/xref " format="html">Terminology Checker add-on</xref> can also match disallowed words and phrases in the terminology rules file, allowing you to see in the visual editor the style guide problems and to correct them using the bundled <uicontrol class="+ topic/ph ui-d/uicontrol ">Fix Terminology Problems</uicontrol> AI action.
ro: Suplimentul <xref href="https://www.oxygenxml.com/doc/ug-addons/topics/terminology-checker-addon.html" scope="external" class="- topic/xref " format="html">Terminology Checker</xref> din Oxygen poate identifica și cuvinte sau expresii interzise din fișierul de reguli de terminologie, permițându-vă să vedeți în editorul vizual problemele de stil și să le corectați folosind acțiunea AI inclusă <uicontrol class="+ topic/ph ui-d/uicontrol ">Fix Terminology Problems</uicontrol>.

source: <b class="+ topic/ph hi-d/b ">Style Guide</b> rules may also impose structural aspects for the DITA XML content and such rules can be automated by converting them to <xref href="SchematronBCs.dita" class="- topic/xref ">Schematron rules</xref>. Once such Schematron rules are added to the DITA XML project and start showing errors in the edited content, the bundled <b class="+ topic/ph hi-d/b ">Fix Validation Problems</b> AI action can be used to ask the AI to fix the reported problems in the current document. If the AI engine attempts to save content to a topic and the saved content has validation problems, the AI receives the validation problems and attempts to auto fix the problems until the topic becomes valid.
ro: Regulile din <b class="+ topic/ph hi-d/b ">Ghidul de stil</b> pot impune și aspecte structurale pentru conținutul DITA XML, iar astfel de reguli pot fi automatizate prin conversia lor în <xref href="SchematronBCs.dita" class="- topic/xref ">reguli Schematron</xref>. Odată ce aceste reguli Schematron sunt adăugate în proiectul DITA XML și încep să afișeze erori în conținutul editat, acțiunea AI inclusă <b class="+ topic/ph hi-d/b ">Fix Validation Problems</b> poate fi folosită pentru a solicita AI-ului să corecteze problemele raportate în documentul curent. Dacă motorul AI încearcă să salveze conținut într-un topic și conținutul salvat are probleme de validare, AI-ul primește problemele de validare și încearcă să le corecteze automat până când topicul devine valid.

source: An alternative to defining a style guide in the AI context prompt or to impose them after the content is generated would be to create a fine-tuned AI model trained with small examples based on the internal style guide and created also using an AI model.
ro: O alternativă la definirea unui ghid de stil în contextul prompt AI sau la impunerea regulilor după generarea conținutului ar fi crearea unui model AI antrenat special, cu exemple mici bazate pe ghidul de stil intern și create tot cu ajutorul unui model AI.

source: DITA XML DTD/Schemas Specialization
ro: Specializarea DTD/Scheme DITA XML

source: Quite often, a company that uses the DITA XML standard may decide to create a DTD or RelaxNG based specialization that defines new XML elements that are not known by the AI engine.
ro: Adesea, o companie care folosește standardul DITA XML poate decide să creeze o specializare bazată pe DTD sau RelaxNG care definește elemente XML noi, necunoscute motorului AI.

source: Most bundled AI actions attempt to preserve the existing XML structure, as much as possible. AI actions like <uicontrol class="+ topic/ph ui-d/uicontrol ">Expand Draft</uicontrol> start from a newly created DITA XML topic and thus preserves the existing DTD/schema reference and XML elements.
ro: Majoritatea acțiunilor AI incluse încearcă să păstreze cât mai mult structura XML existentă. Acțiuni precum <uicontrol class="+ topic/ph ui-d/uicontrol ">Expand Draft</uicontrol> pornesc de la un topic DITA XML nou creat și astfel păstrează referința DTD/schema și elementele XML existente.

source: Actions like <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate Documentation Draft</uicontrol> can specify (in their definition) that a certain XML structure must be generated. An example, for this can be found <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Documentation%20Draft/Formant%20and%20Indent%20Sample/doc-draft-model-specialization.xml" scope="external" class="- topic/xref " format="html">here</xref>.
ro: Acțiuni precum <uicontrol class="+ topic/ph ui-d/uicontrol ">Generate Documentation Draft</uicontrol> pot specifica (în definiția lor) că trebuie generată o anumită structură XML. Un exemplu pentru aceasta poate fi găsit <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Documentation%20Draft/Formant%20and%20Indent%20Sample/doc-draft-model-specialization.xml" scope="external" class="- topic/xref " format="html">aici</xref>.

source: The most important XML vocabulary changes (DTD/schema references, newly added XML elements) can be distilled and set in the <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/preferences.html#preferences__dlentry_afh_cck_sfd" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">Context prompt</b></xref> text area within the <b class="+ topic/ph hi-d/b ">AI Positron Assistant</b> preferences page.
ro: Cele mai importante modificări de vocabular XML (referințe DTD/schema, elemente XML nou adăugate) pot fi sintetizate și setate în zona de text <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/preferences.html#preferences__dlentry_afh_cck_sfd" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">Context prompt</b></xref> din pagina de preferințe <b class="+ topic/ph hi-d/b ">AI Positron Assistant</b>.

source: Example of vocabulary changes described in the prompt context:
ro: Exemplu de modificări de vocabular descrise în contextul prompt:

source: # Vocabulary Changes DITA XML topics generated for our project's user's manual have the following structure and DOCTYPE declaration: ``` <!DOCTYPE oxyTopic PUBLIC "OXY-PUB-TOPIC" "oxy-system"> <oxyTopic> <title></title> <body> </body> </oxyTopic> ``` DITA XML concepts generated for our project's user's manual have the following structure and DOCTYPE declaration: ``` <!DOCTYPE oxyConcept PUBLIC "OXY-PUB-CONCEPT" "oxy-system"> <oxyConcept> <title></title> <body> </body> </oxyConcept> ``` New DITA XML elements are defined in our specific DITA XML vocabulary as follows: There is a new <part-term> XML element which must be used to tag various car parts. There is a new <product> XML element which must be used to tag product names. Example: The <product>Hisense</product> <part-term>engine</part-term> is more efficient.
ro: # Modificări de vocabular Topicurile DITA XML generate pentru manualul de utilizare al proiectului nostru au următoarea structură și declarație DOCTYPE: ``` <!DOCTYPE oxyTopic PUBLIC "OXY-PUB-TOPIC" "oxy-system"> <oxyTopic> <title></title> <body> </body> </oxyTopic> ``` Conceptele DITA XML generate pentru manualul de utilizare al proiectului nostru au următoarea structură și declarație DOCTYPE: ``` <!DOCTYPE oxyConcept PUBLIC "OXY-PUB-CONCEPT" "oxy-system"> <oxyConcept> <title></title> <body> </body> </oxyConcept> ``` Elemente DITA XML noi sunt definite în vocabularul nostru DITA XML specific astfel: Există un nou element XML <part-term> care trebuie folosit pentru a marca diverse piese auto. Există un nou element XML <product> care trebuie folosit pentru a marca denumirile de produse. Exemplu: <product>Hisense</product> <part-term>engine</part-term> este mai eficient.

source: Conclusion
ro: Concluzie

source: You need to invest time to adapt the AI Positron add-on to generate better content for your particular project and organization particularities.
ro: Este necesar să investiți timp pentru a adapta suplimentul AI Positron astfel încât să genereze conținut mai bun pentru particularitățile proiectului și organizației dumneavoastră.

source: By specifying your specific project particularities in a context prompt, content created and re-written by an AI engine can become much more precise and fit better with your existing ways of working. Some of your project's rules can be automated allowing you to also detect and fix such problems after the content is generated using the AI engine.
ro: Prin specificarea particularităților proiectului dumneavoastră într-un context prompt, conținutul creat și rescris de motorul AI poate deveni mult mai precis și mai bine adaptat modului dumneavoastră de lucru. Unele reguli ale proiectului pot fi automatizate, permițându-vă să detectați și să corectați astfel de probleme după generarea conținutului cu ajutorul AI.

source: An example of a detailed context prompt that contains an overview of the project and audience, terminology, style rules, described vocabulary changes can be found <xref href="https://raw.githubusercontent.com/oxygenxml-incubator/ai-positron-assistant-samples/refs/heads/main/Custom%20Actions/ai-context-sample.md" scope="external" class="- topic/xref " format="html">here</xref>.
ro: Un exemplu de context prompt detaliat, care conține o prezentare generală a proiectului și a publicului țintă, terminologie, reguli de stil, modificări de vocabular descrise, poate fi găsit <xref href="https://raw.githubusercontent.com/oxygenxml-incubator/ai-positron-assistant-samples/refs/heads/main/Custom%20Actions/ai-context-sample.md" scope="external" class="- topic/xref " format="html">aici</xref>.

source: Overcoming Challenges - Editing DITA XML content with AI Tools (Presentation)
ro: Depășirea provocărilor – Editarea conținutului DITA XML cu instrumente AI (Prezentare)

source: The DITA XML standard is recognized (for good reason) for its versatile reuse capabilities, which allows for creating content that is consistent and can be used to single-source the entire publication needs of a company.
ro: Standardul DITA XML este recunoscut (pe bună dreptate) pentru capacitățile sale versatile de reutilizare, care permit crearea de conținut coerent și utilizabil pentru a acoperi toate nevoile de publicare ale unei companii dintr-o singură sursă.

source: AI editing tools can bring lots of extra benefits for technical documentation writers, capabilities for re-writing content to improve readability, grammar checking, content generation, generating reports, and much more.
ro: Instrumentele de editare AI pot aduce numeroase beneficii suplimentare pentru redactorii de documentație tehnică, oferind capabilități de rescriere a conținutului pentru îmbunătățirea lizibilității, verificare gramaticală, generare de conținut, generare de rapoarte și multe altele.

source: How do these benefits interact with the DITA XML features (content reuse, specialization) and how can AI tools be developed to work better with these DITA XMl specific features?
ro: Cum interacționează aceste beneficii cu funcționalitățile DITA XML (reutilizarea conținutului, specializare) și cum pot fi dezvoltate instrumentele AI pentru a lucra mai bine cu aceste caracteristici specifice DITA XML?

source: The presentation below enumerates various useful AI-related actions and checks how they interact with DITA XML content, especially with DITA XML features such as specialization, content reuse, or filtering. It all considers how the AI actions can be made more DITA XML-aware to be better integrated with a particular organization's needs.
ro: Prezentarea de mai jos enumeră diverse acțiuni utile legate de AI și verifică modul în care acestea interacționează cu conținutul DITA XML, în special cu funcționalități precum specializarea, reutilizarea conținutului sau filtrarea. Totul are în vedere modul în care acțiunile AI pot fi făcute mai conștiente de DITA XML pentru a fi mai bine integrate cu nevoile specifice ale unei organizații.

source: Embedding Diagrams in DITA Topics Using Mermaid
ro: Înglobarea diagramelor în topicuri DITA folosind Mermaid

source: DITA Diagrams</keyword> <keyword outputclass="label" class="- topic/keyword ">DITA Publishing Customization
ro: Diagrame DITA</keyword> <keyword outputclass="label" class="- topic/keyword ">Personalizare publicare DITA

source: <xref href="https://mermaid-js.github.io/mermaid/#/" scope="external" class="- topic/xref " format="html">Mermaid</xref> is a neat library that takes textual descriptions of diagrams and produces visual diagrams from them.
ro: <xref href="https://mermaid-js.github.io/mermaid/#/" scope="external" class="- topic/xref " format="html">Mermaid</xref> este o bibliotecă interesantă care preia descrieri textuale ale diagramelor și generează din acestea diagrame vizuale.

source: Suppose you have a DITA topic that embeds such a textual description of a diagram: <xref href="https://github.com/oxygenxml/dita-ot-diagrams-plugin/blob/master/com.oxygenxml.diagrams.svg/samples/testMermaidDiagram.dita" scope="external" class="- topic/xref " format="html"/>.
ro: Presupuneți că aveți un topic DITA care înglobează o astfel de descriere textuală a unei diagrame: <xref href="https://github.com/oxygenxml/dita-ot-diagrams-plugin/blob/master/com.oxygenxml.diagrams.svg/samples/testMermaidDiagram.dita" scope="external" class="- topic/xref " format="html"/>.
