Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: Describes how the XML content from the document that is sent to the platform should be processed, as regular XML including markup tags or as plain text without the tags and with all DITA XML content references and key references expanded. By default, its value is assumed to be <codeph class="+ topic/ph pr-d/codeph ">markup</codeph>, which means the content is sent exactly as it is.
ro: Descrie modul în care conținutul XML din documentul trimis către platformă trebuie procesat: ca XML obișnuit, incluzând tag-urile de markup, sau ca text simplu, fără tag-uri și cu toate conref-urile și keyref-urile DITA XML expandate. Implicit, valoarea este <codeph class="+ topic/ph pr-d/codeph ">markup</codeph>, ceea ce înseamnă că se trimite conținutul exact așa cum este.

source: Example of an AI action that requires the input to be sent without any markup tags and with the DITA XML conrefs and keyrefs expanded:
ro: Exemplu de acțiune AI care necesită ca inputul să fie trimis fără niciun tag de markup și cu conref-urile și keyref-urile DITA XML expandate:

source: Defines the type of change the AI action performs on the opened document. Some of the most commonly used type values are listed below:
ro: Definește tipul de modificare pe care acțiunea AI o efectuează asupra documentului deschis. Câteva dintre cele mai folosite valori de tip sunt enumerate mai jos:

source: The most common type of action. Sends the selected content to the AI platform and proposes to replace the selection with the received response. If there is no selected content automatically, the entire document is selected when the action is invoked.
ro: Cel mai comun tip de acțiune. Trimite conținutul selectat către platforma AI și propune înlocuirea selecției cu răspunsul primit. Dacă nu există conținut selectat, automat este selectat întregul document când acțiunea este invocată.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/Replace_bold_with_uicontrol.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/Replace_bold_with_uicontrol.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: Inserts the content received from the AI engine in the current document at the cursor position or at an offset specified by the <codeph class="+ topic/ph pr-d/codeph ">insert-modes</codeph>. If the inserted content is invalid at the proposed offset, the application attempts to find a proper location for it.
ro: Inserează conținutul primit de la motorul AI în documentul curent la poziția cursorului sau la un offset specificat de <codeph class="+ topic/ph pr-d/codeph ">insert-modes</codeph>. Dacă conținutul inserat este invalid la offsetul propus, aplicația încearcă să găsească o locație potrivită pentru acesta.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/update-title.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/update-title.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: Sends the selected content or the entire document to the AI platform and shows the response to the end user.
ro: Trimite conținutul selectat sau întregul document către platforma AI și afișează răspunsul utilizatorului final.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/review-logical-mistakes.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/review-logical-mistakes.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: Shows a dialog box that asks for a context and then creates a new document based on the received server response. The <codeph class="+ topic/ph pr-d/codeph ">"additional_info"/"properties"/"file_extension"</codeph> property can be set to impose an extension for the newly created document.
ro: Afișează o casetă de dialog care solicită un context și apoi creează un document nou pe baza răspunsului primit de la server. Proprietatea <codeph class="+ topic/ph pr-d/codeph ">"additional_info"/"properties"/"file_extension"</codeph> poate fi setată pentru a impune o extensie pentru documentul nou creat.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/create-schematron-rules.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/create-schematron-rules.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: A JSON array that defines places for inserting the content in an XML document. The first mode for which the XPath condition becomes true is <i class="+ topic/ph hi-d/i ">run</i>. Such modes are used when the AI action <codeph class="+ topic/ph pr-d/codeph ">output-action</codeph> is <codeph class="+ topic/ph pr-d/codeph ">insert</codeph>.
ro: Un array JSON care definește locuri pentru inserarea conținutului într-un document XML. Primul mod pentru care condiția XPath devine adevărată este <i class="+ topic/ph hi-d/i ">run</i>. Astfel de moduri sunt folosite când <codeph class="+ topic/ph pr-d/codeph ">output-action</codeph> al acțiunii AI este <codeph class="+ topic/ph pr-d/codeph ">insert</codeph>.

source: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/update-title.json" scope="external" class="- topic/xref " format="html">Example</xref>:
ro: <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/update-title.json" scope="external" class="- topic/xref " format="html">Exemplu</xref>:

source: Set this optional boolean parameter to <codeph class="+ topic/ph pr-d/codeph ">true</codeph> to add the AI action to the top right <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron Assistant</uicontrol> drop-down menu that appears when editing content in the <uicontrol class="+ topic/ph ui-d/uicontrol ">Author</uicontrol> visual editing mode.
ro: Setați acest parametru boolean opțional la <codeph class="+ topic/ph pr-d/codeph ">true</codeph> pentru a adăuga acțiunea AI în meniul drop-down din colțul dreapta sus <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron Assistant</uicontrol> care apare la editarea conținutului în modul vizual <uicontrol class="+ topic/ph ui-d/uicontrol ">Author</uicontrol>.

source: Set this optional boolean parameter to <codeph class="+ topic/ph pr-d/codeph ">true</codeph> to add the AI action to the quick assist bulb drop-down menu that appears in the left vertical stripe.
ro: Setați acest parametru boolean opțional la <codeph class="+ topic/ph pr-d/codeph ">true</codeph> pentru a adăuga acțiunea AI în meniul drop-down de tip bec de asistență rapidă care apare pe bara verticală din stânga.

source: Hope this helped, as always you can use the feedback form below if you want to ask more details about the possibilities of AI actions or want to brag about the custom AI actions you have created.
ro: Sper că aceste informații v-au fost de ajutor. Ca de obicei, puteți folosi formularul de feedback de mai jos dacă doriți să întrebați mai multe detalii despre posibilitățile acțiunilor AI sau dacă vreți să vă lăudați cu acțiunile AI personalizate pe care le-ați creat.

source: Creating Link Graphs From DITA Maps
ro: Crearea grafurilor de legături din DITA Maps

source: It may be sometimes useful as an overview to obtain a graphical visualization of how your DITA topics refer to each other. The <xref href="https://visjs.github.io/vis-network/docs/network/index.html" scope="external" class="- topic/xref " format="html">VisJS</xref> Javascript library can be used to construct node network diagrams. Here's how you can use it for your DITA project:
ro: Poate fi uneori util, ca prezentare generală, să obțineți o vizualizare grafică a modului în care topicurile DITA se referă unele la altele. Biblioteca Javascript <xref href="https://visjs.github.io/vis-network/docs/network/index.html" scope="external" class="- topic/xref " format="html">VisJS</xref> poate fi folosită pentru a construi diagrame de rețea de noduri. Iată cum o puteți utiliza pentru proiectul dumneavoastră DITA:

source: Open the main DITA Map in the <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> <uicontrol class="+ topic/ph ui-d/uicontrol ">DITA Maps Manager</uicontrol> view, use the <uicontrol class="+ topic/ph ui-d/uicontrol ">Configure Transformation Scenarios</uicontrol> button, then create a new transformation scenario of type <uicontrol class="+ topic/ph ui-d/uicontrol ">DITA OT Transformation</uicontrol> choosing the <uicontrol class="+ topic/ph ui-d/uicontrol ">Merge DITA Content to Single XML file</uicontrol> transformation type. If you are not using <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> you can download and install the <uicontrol class="+ topic/ph ui-d/uicontrol ">dita-merge</uicontrol> plugin separately from <xref href="https://github.com/oxygenxml/dita-merged" scope="external" class="- topic/xref " format="html">Github</xref>.
ro: Deschideți DITA Map-ul principal în <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> în vizualizarea <uicontrol class="+ topic/ph ui-d/uicontrol ">DITA Maps Manager</uicontrol>, folosiți butonul <uicontrol class="+ topic/ph ui-d/uicontrol ">Configure Transformation Scenarios</uicontrol>, apoi creați un nou scenariu de transformare de tip <uicontrol class="+ topic/ph ui-d/uicontrol ">DITA OT Transformation</uicontrol> alegând tipul de transformare <uicontrol class="+ topic/ph ui-d/uicontrol ">Merge DITA Content to Single XML file</uicontrol>. Dacă nu folosiți <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph>, puteți descărca și instala separat pluginul <uicontrol class="+ topic/ph ui-d/uicontrol ">dita-merge</uicontrol> de pe <xref href="https://github.com/oxygenxml/dita-merged" scope="external" class="- topic/xref " format="html">Github</xref>.

source: Apply the new transformation scenario on the DITA Map, once the merged XML document is generated, create another transformation scenario of type <uicontrol class="+ topic/ph ui-d/uicontrol ">XML transformation with XSLT</uicontrol> and transform to HTML using the XSLT stylesheet: <xref href="https://github.com/oxygenxml/dita-merged/blob/master/possible-applications/createHTMLVisGraph.xsl" scope="external" class="- topic/xref " format="xsl"/>
ro: Aplicați noul scenariu de transformare pe DITA Map, iar după ce documentul XML fuzionat este generat, creați un alt scenariu de transformare de tip <uicontrol class="+ topic/ph ui-d/uicontrol ">XML transformation with XSLT</uicontrol> și transformați în HTML folosind foaia de stil XSLT: <xref href="https://github.com/oxygenxml/dita-merged/blob/master/possible-applications/createHTMLVisGraph.xsl" scope="external" class="- topic/xref " format="xsl"/>

source: Open the result HTML document in a web browser. Depending on the complexity of the DITA project it may take some time for the diagram to show up. As an example the related links section below contains a reference to a diagram representation of the Oxygen XML Blog. If we regard the diagram as a circle, on the outer bounds of the circle are topics which have few incoming and outgoing links and in the center topics which have many outgoing and incoming links. Links from the DITA Map to the topics are not taken into account. You can interact with the diagram by dragging nodes and by using the mouse wheel to zoom in or out.
ro: Deschideți documentul HTML rezultat într-un browser web. În funcție de complexitatea proiectului DITA, poate dura ceva timp până când diagrama va fi afișată. De exemplu, secțiunea de linkuri conexe de mai jos conține o referință la o reprezentare diagramatică a Oxygen XML Blog. Dacă privim diagrama ca pe un cerc, la marginea exterioară a cercului se află topicuri cu puține legături de intrare și ieșire, iar în centru topicuri cu multe legături de intrare și ieșire. Legăturile din DITA Map către topicuri nu sunt luate în considerare. Puteți interacționa cu diagrama prin tragerea nodurilor și folosind rotița mouse-ului pentru a mări sau micșora.

source: Customizing AI Positron for Your DITA XML Project
ro: Personalizarea AI Positron pentru proiectul dumneavoastră DITA XML

source: The Oxygen AI Positron Add-on includes a variety of helpful AI actions designed to boost productivity. However, <b class="+ topic/ph hi-d/b ">DITA XML</b> projects have specific requirements. They often need particular <b class="+ topic/ph hi-d/b ">terminology</b> and adherence to <b class="+ topic/ph hi-d/b ">style guide rules</b>, or they may rely on company-specific <b class="+ topic/ph hi-d/b ">DITA</b> specialization DTDs/schemas that differ from the standard <b class="+ topic/ph hi-d/b ">DITA DTDs</b> that the AI models are trained on. Therefore, to generate high-quality content using the AI actions, the add-on must be configured to understand the unique aspects of the <b class="+ topic/ph hi-d/b ">DITA XML</b> project it will be used with.
ro: Oxygen AI Positron Add-on include o varietate de acțiuni AI utile concepute pentru a crește productivitatea. Totuși, proiectele <b class="+ topic/ph hi-d/b ">DITA XML</b> au cerințe specifice. Acestea necesită adesea <b class="+ topic/ph hi-d/b ">terminologie</b> particulară și respectarea <b class="+ topic/ph hi-d/b ">regulilor din ghidul de stil</b> sau pot depinde de <b class="+ topic/ph hi-d/b ">DITA</b> DTD-uri/scheme de specializare specifice companiei, care diferă de <b class="+ topic/ph hi-d/b ">DTD-urile DITA</b> standard pe care sunt antrenate modelele AI. Prin urmare, pentru a genera conținut de calitate folosind acțiunile AI, suplimentul trebuie configurat astfel încât să înțeleagă particularitățile proiectului <b class="+ topic/ph hi-d/b ">DITA XML</b> cu care va fi utilizat.

source: AI Tools Pros/Cons
ro: Avantaje/Dezavantaje ale instrumentelor AI

source: With their ability to <b class="+ topic/ph hi-d/b ">rewrite</b>, <b class="+ topic/ph hi-d/b ">research</b>, and <b class="+ topic/ph hi-d/b ">generate documentation drafts</b> AI models can be useful in a variety of cases as long as aspects specific to the current DITA XML project can be controlled and enforced.
ro: Datorită capacității lor de a <b class="+ topic/ph hi-d/b ">rescrie</b>, de a <b class="+ topic/ph hi-d/b ">cerceta</b> și de a <b class="+ topic/ph hi-d/b ">genera schițe de documentație</b>, modelele AI pot fi utile în diverse situații, atâta timp cât pot fi controlate și impuse aspectele specifice proiectului DITA XML curent.

source: Good
ro: Bine

source: Bad/Ugly
ro: Rău/Urat

source: <b class="+ topic/ph hi-d/b ">Re-write</b> content (correct grammar, active voice, style, readability improvements).
ro: <b class="+ topic/ph hi-d/b ">Rescrierea</b> conținutului (corectarea gramaticii, voce activă, îmbunătățirea stilului și a lizibilității).

source: The company specific style guide might impose certain rules that, by default, are not taken into account by the AI model.
ro: Ghidul de stil specific companiei poate impune anumite reguli care, implicit, nu sunt luate în considerare de modelul AI.

source: <b class="+ topic/ph hi-d/b ">Generating draft content</b> by combining multiple sources (including images, attached <b class="+ topic/ph hi-d/b ">PDF</b>, <b class="+ topic/ph hi-d/b ">Word</b> or <b class="+ topic/ph hi-d/b ">Markdown</b> documents).
ro: <b class="+ topic/ph hi-d/b ">Generarea de conținut de tip schiță</b> prin combinarea mai multor surse (inclusiv imagini, <b class="+ topic/ph hi-d/b ">PDF</b> atașat, documente <b class="+ topic/ph hi-d/b ">Word</b> sau <b class="+ topic/ph hi-d/b ">Markdown</b>).

source: Hallucinations when generating content if not enough quality context information is provided. The overall terminology or style guide is not taken into account. The DITA XML specializations are also not taken into account by default.
ro: Pot apărea „halucinații” la generarea conținutului dacă nu este furnizată suficientă informație contextuală de calitate. Terminologia generală sau ghidul de stil nu sunt luate în considerare. Specializările DITA XML nu sunt nici ele luate în considerare implicit.

source: <b class="+ topic/ph hi-d/b ">Research</b> / <b class="+ topic/ph hi-d/b ">Explain</b> concepts (chat).
ro: <b class="+ topic/ph hi-d/b ">Cercetare</b> / <b class="+ topic/ph hi-d/b ">Explicare</b> concepte (chat).

source: By default an AI model responds to questions based on its training and not on the content from the current user’s manual.
ro: Implicit, un model AI răspunde la întrebări pe baza antrenamentului său și nu pe baza conținutului din manualul de utilizare curent.

source: Access Content From Your Project
ro: Acces la conținutul din proiectul dumneavoastră

source: By default, when <b class="+ topic/ph hi-d/b ">researching</b> or <b class="+ topic/ph hi-d/b ">asking</b> the AI questions, <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/tools_rag_preferences.html" scope="external" class="- topic/xref " format="html">Retrieval Augmented Generation (RAG)</xref> tools give the AI access to <b class="+ topic/ph hi-d/b ">search for specific keywords</b> in your current DITA XML documentation and thus provide the AI access to the content of topics which are related and relevant to your discussion.
ro: Implicit, când <b class="+ topic/ph hi-d/b ">cercetați</b> sau <b class="+ topic/ph hi-d/b ">adresați</b> întrebări AI-ului, instrumentele <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/tools_rag_preferences.html" scope="external" class="- topic/xref " format="html">Retrieval Augmented Generation (RAG)</xref> oferă AI-ului acces la <b class="+ topic/ph hi-d/b ">căutarea unor cuvinte cheie specifice</b> în documentația DITA XML curentă și astfel permit AI-ului accesul la conținutul topicurilor relevante pentru discuția dumneavoastră.

source: Bundled AI actions like <b class="+ topic/ph hi-d/b ">Generate Documentation Draft</b>, <b class="+ topic/ph hi-d/b ">Expand Draft</b>, <b class="+ topic/ph hi-d/b ">Create Topics</b> give the AI model access to the current indexed DITA XML project to retrieve the topics with content similar to the new content that needs to be created.
ro: Acțiunile AI incluse, precum <b class="+ topic/ph hi-d/b ">Generate Documentation Draft</b>, <b class="+ topic/ph hi-d/b ">Expand Draft</b>, <b class="+ topic/ph hi-d/b ">Create Topics</b>, oferă modelului AI acces la proiectul DITA XML indexat curent pentru a regăsi topicurile cu conținut similar cu cel nou ce trebuie creat.

source: You can create your own <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/creating_custom_ai_actions.html" scope="external" class="- topic/xref " format="html">custom AI actions</xref> that allow RAG access to the current project contents for the AI engine. An example can be found <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/add-related-links.json" scope="external" class="- topic/xref " format="html">here</xref>.
ro: Puteți crea propriile <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/creating_custom_ai_actions.html" scope="external" class="- topic/xref " format="html">acțiuni AI personalizate</xref> care permit motorului AI acces RAG la conținutul proiectului curent. Un exemplu poate fi găsit <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/blob/main/Custom%20Actions/add-related-links.json" scope="external" class="- topic/xref " format="html">aici</xref>.

source: Overall Project Context and Audience
ro: Contextul general al proiectului și publicul țintă

source: In the Oxygen <b class="+ topic/ph hi-d/b ">Preferences</b> <b class="+ topic/ph hi-d/b ">AI Positron Assistant</b> preferences page you can set in the <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/preferences.html#preferences__dlentry_afh_cck_sfd" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">Context prompt</b></xref> text area general information about the current project and the intended audience. This context information will be used subsequently for all AI actions and chat sessions.
ro: În pagina de preferințe <b class="+ topic/ph hi-d/b ">Preferences</b> <b class="+ topic/ph hi-d/b ">AI Positron Assistant</b> din Oxygen, puteți seta în zona de text <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/preferences.html#preferences__dlentry_afh_cck_sfd" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">Context prompt</b></xref> informații generale despre proiectul curent și publicul țintă. Aceste informații de context vor fi folosite ulterior pentru toate acțiunile AI și sesiunile de chat.

source: Example of a context which establishes an overall project scope and audience:
ro: Exemplu de context care stabilește scopul general al proiectului și publicul țintă:

source: # Project context The current project contains technical documentation for a fun and easy to drive dune vehicle named the Sharkfin Rover. # Audience Technical documentation must be precise and easy to understand. Our clients are not technical, they are usually beginners when it comes to driving and their understanding of English may vary.
ro: # Contextul proiectului Proiectul curent conține documentație tehnică pentru un vehicul de tip dune buggy, distractiv și ușor de condus, numit Sharkfin Rover. # Public țintă Documentația tehnică trebuie să fie precisă și ușor de înțeles. Clienții noștri nu sunt tehnici, de obicei sunt începători în condus, iar nivelul lor de înțelegere a limbii engleze poate varia.

source: The same context information should be expanded to include terminology and style guide information for the current project. An example can be found <xref href="https://raw.githubusercontent.com/oxygenxml-incubator/ai-positron-assistant-samples/refs/heads/main/Custom%20Actions/ai-context-sample.md" scope="external" class="- topic/xref " format="html">here </xref>.
ro: Aceleași informații de context ar trebui extinse pentru a include terminologia și informațiile din ghidul de stil pentru proiectul curent. Un exemplu poate fi găsit <xref href="https://raw.githubusercontent.com/oxygenxml-incubator/ai-positron-assistant-samples/refs/heads/main/Custom%20Actions/ai-context-sample.md" scope="external" class="- topic/xref " format="html">aici </xref>.

source: Terminology Rules
ro: Reguli de terminologie

source: A DITA XML project may define (in various formats) allowed terms and certain synonyms that are not recommended to be used instead of the allowed terminology.
ro: Un proiect DITA XML poate defini (în diverse formate) termeni acceptați și anumiți sinonimi care nu sunt recomandați a fi folosiți în locul terminologiei permise.
