Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: Convert this CSV content containing headers to a DITA XML table element: Common name,Scientific name,Location,Temperament,Diet,Water,Size,Region of the Aquarium,Breeding Compressiceps,Haplochromis compressiceps,Lake Tanganyika,Territorial,Omnivore,"PH 7.0 - 8.0, Temp. 73 - 77 F",5 inches,Bottom,Hard Frontosa,Cyphotilapia frontosus,Lake Tanganyika,Very peaceful,Omnivore,"PH 7.8 - 8.5, Temp 75F - 82F",14 inches,Middle-Bottom,Medium
ro: Convertiți acest conținut CSV care conține anteturi într-un element tabel DITA XML: Common name,Scientific name,Location,Temperament,Diet,Water,Size,Region of the Aquarium,Breeding Compressiceps,Haplochromis compressiceps,Lake Tanganyika,Territorial,Omnivore,"PH 7.0 - 8.0, Temp. 73 - 77 F",5 inches,Bottom,Hard Frontosa,Cyphotilapia frontosus,Lake Tanganyika,Very peaceful,Omnivore,"PH 7.8 - 8.5, Temp 75F - 82F",14 inches,Middle-Bottom,Medium

source: Writing Style
ro: Stil de redactare

source: Ask what terminology to use in certain cases.
ro: Întrebați ce terminologie să folosiți în anumite cazuri.

source: Should I use for technical documentation the phrase "click a button" or "press a button"?
ro: Ar trebui să folosesc pentru documentație tehnică expresia „click a button” sau „press a button”?

source: Re-phrase documentation provided by engineers using the Microsoft Style Guide style and also change the point of view from first-person to third-person.
ro: Reformulați documentația furnizată de ingineri folosind stilul Microsoft Style Guide și schimbați și persoana din întâi în a treia.

source: Re-phrase the following content to adhere to the Microsoft Style Guide, third person: The action Show only keys with closest relative key scope from DITA Reusable Components / Keys tab was also added to Media tab Settings drop down menu The states of the two actions are synchronized. If you check it in Keys tab will automatically get checked in Media tab
ro: Reformulați următorul conținut pentru a respecta Microsoft Style Guide, persoana a treia: The action Show only keys with closest relative key scope from DITA Reusable Components / Keys tab was also added to Media tab Settings drop down menu The states of the two actions are synchronized. If you check it in Keys tab will automatically get checked in Media tab

source: Translate some notes from the engineer's native language (in this case, Romanian with a mix of English words) to English, re-phrase using the Microsoft Style Guide style, and also change the point of view from first-person to third-person.
ro: Traduceți câteva note din limba maternă a inginerului (în acest caz, română cu un amestec de cuvinte în engleză) în engleză, reformulați folosind stilul Microsoft Style Guide și schimbați și persoana din întâi în a treia.

source: Translate to English, rephrase to adhere to the Microsoft Style Guide, third person: In tabul Media, in meniul Settings a aparut actiunea Show only keys with closest relative key scope Cand o bifam trebuie sa ramana in view doar cheile relative (cheile cu forma cea mai scurta).
ro: Traduceți în engleză, reformulați pentru a respecta Microsoft Style Guide, persoana a treia: In tabul Media, in meniul Settings a aparut actiunea Show only keys with closest relative key scope Cand o bifam trebuie sa ramana in view doar cheile relative (cheile cu forma cea mai scurta).

source: Re-write an entire DITA XML topic to increase its readability.
ro: Rescrieți un întreg topic DITA XML pentru a-i crește lizibilitatea.

source: Re-write the following DITA XML topic preserving all its original XML elements to increase its readability: <topic id="dita_oriented_tips_and_tricks"> <title>DITA Oriented Tips And Tricks</title> <prolog> <author>Radu Coravu</author> </prolog> <body> <p><ph keyref="oxygen"/> has about 18 years of development under its wings. During these years, we added lots of functionality and many of our users usually do not know more than 20-30% of Oxygen's features. So this presentation is intended for technical writers using Oxygen to write DITA content and who may want to find out more about their tool.</p> <section id="section_gld_tbs_gfb"> <title>Add-ons</title> <p>There are lots of free add-ons provided by the Oxygen team that can be installed in an <xref href="https://github.com/search?q=topic%3Aadd-on+org%3Aoxygenxml&amp;type=Repositories" format="html" scope="external">Oxygen standalone version</xref>. I will enumerate some of the most interesting one:</p> <ul id="ul_xbw_ccs_gfb"> <li><xref href="https://github.com/oxygenxml/oxygen-git-plugin" format="html" scope="external">Git add-on</xref>. This plugin adds a side view allowing you to do some common Git operations like pull, commit, push (mostly 90% of what a regular Git user would do).</li> <li><xref href="https://www.oxygenxml.com/doc/ug-editor/topics/content-fusion-addon.html" format="html" scope="external">Content Fusion Connector add-on</xref>. Collaborate with your peers by sending them links that allow them to give you feedback on your work using a web browser without the need to pre-install anything on their side. </li> </ul> </section> </body> </topic>
ro: Rescrieți următorul topic DITA XML păstrând toate elementele XML originale pentru a-i crește lizibilitatea: <topic id="dita_oriented_tips_and_tricks"> <title>DITA Oriented Tips And Tricks</title> <prolog> <author>Radu Coravu</author> </prolog> <body> <p><ph keyref="oxygen"/> has about 18 years of development under its wings. During these years, we added lots of functionality and many of our users usually do not know more than 20-30% of Oxygen's features. So this presentation is intended for technical writers using Oxygen to write DITA content and who may want to find out more about their tool.</p> <section id="section_gld_tbs_gfb"> <title>Add-ons</title> <p>There are lots of free add-ons provided by the Oxygen team that can be installed in an <xref href="https://github.com/search?q=topic%3Aadd-on+org%3Aoxygenxml&amp;type=Repositories" format="html" scope="external">Oxygen standalone version</xref>. I will enumerate some of the most interesting one:</p> <ul id="ul_xbw_ccs_gfb"> <li><xref href="https://github.com/oxygenxml/oxygen-git-plugin" format="html" scope="external">Git add-on</xref>. This plugin adds a side view allowing you to do some common Git operations like pull, commit, push (mostly 90% of what a regular Git user would do).</li> <li><xref href="https://www.oxygenxml.com/doc/ug-editor/topics/content-fusion-addon.html" format="html" scope="external">Content Fusion Connector add-on</xref>. Collaborate with your peers by sending them links that allow them to give you feedback on your work using a web browser without the need to pre-install anything on their side. </li> </ul> </section> </body> </topic>

source: Result:
ro: Rezultat:

source: Remarks: If the prompt insists that all XML elements should be preserved, the re-write does few things, but if the prompt does not insist that all XML elements should be preserved, the inline elements and links are removed.
ro: Observații: Dacă promptul insistă ca toate elementele XML să fie păstrate, rescrierea face puține modificări, dar dacă promptul nu insistă asupra păstrării tuturor elementelor XML, elementele inline și legăturile sunt eliminate.

source: Statistics
ro: Statistici

source: Create readability analysis for a DITA XML topic.
ro: Creați o analiză a lizibilității pentru un topic DITA XML.

source: Create a readability analysis for the following DITA XML topic: <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE topic PUBLIC "-//OASIS//DTD DITA Topic//EN" "topic.dtd"> <topic id="topic_whr_nly_c5"> <title>Sharing Application Settings</title><prolog><author>Radu Coravu</author></prolog> <body> <p>There are various ways in the <b>Oxygen</b> standalone version through which a team of writers .........
ro: Creați o analiză a lizibilității pentru următorul topic DITA XML: <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE topic PUBLIC "-//OASIS//DTD DITA Topic//EN" "topic.dtd"> <topic id="topic_whr_nly_c5"> <title>Sharing Application Settings</title><prolog><author>Radu Coravu</author></prolog> <body> <p>There are various ways in the <b>Oxygen</b> standalone version through which a team of writers .........

source: Custom Validation (Schematron-based)
ro: Validare personalizată (bazată pe Schematron)

source: Create an ISO Schematron validation check that counts words.
ro: Creați o verificare de validare ISO Schematron care să numere cuvintele.

source: Create an ISO Schematron schema which reports if a DITA short description element has more than 20 words.
ro: Creați o schemă ISO Schematron care raportează dacă un element de descriere scurtă DITA are mai mult de 20 de cuvinte.

source: Remark: The namespace declaration and usage is wrong (DITA elements are in no namespace). The assert test is correct.
ro: Observație: Declarația și utilizarea namespace-ului sunt greșite (elementele DITA nu sunt într-un namespace). Testul assert este corect.

source: Create an ISO Schematron validation check from a description.
ro: Creați o verificare de validare ISO Schematron pornind de la o descriere.

source: Create an ISO Schematron validation rule which reports an error if a DITA XML image element does not contain a scale attribute
ro: Creați o regulă de validare ISO Schematron care raportează o eroare dacă un element imagine DITA XML nu conține atributul scale

source: Remark: The namespace declaration and usage is wrong (DITA elements are in no namespace). The assert test is correct.
ro: Observație: Declarația și utilizarea namespace-ului sunt greșite (elementele DITA nu sunt într-un namespace). Testul assert este corect.

source: Practical Steps for Vibe Authoring with AI Positron
ro: Pași practici pentru redactarea Vibe cu AI Positron

source: We initially started work on the <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> add-on for <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> more than 2 years ago by creating useful AI actions to <b class="+ topic/ph hi-d/b ">improve readability</b> of content, <b class="+ topic/ph hi-d/b ">correct grammar</b>, <b class="+ topic/ph hi-d/b ">translate</b>, <b class="+ topic/ph hi-d/b ">proofread</b>, and so on. Gradually, we realized that even when invoking our carefully made prompts wrapped as such AI actions, you need flexibility to further discuss the results with the AI. So we added support to create custom AI actions specific to your needs. Such AI actions, based on prompts tuned by your experts (or ours), continue to be useful for precise use cases and for people who are just starting to use AI tools.
ro: Inițial, am început să lucrăm la suplimentul <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> pentru <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> acum mai bine de 2 ani, creând acțiuni AI utile pentru a <b class="+ topic/ph hi-d/b ">îmbunătăți lizibilitatea</b> conținutului, a <b class="+ topic/ph hi-d/b ">corecta gramatica</b>, a <b class="+ topic/ph hi-d/b ">traduce</b>, a <b class="+ topic/ph hi-d/b ">corecta</b> și așa mai departe. Treptat, am realizat că, chiar și atunci când invoci prompturi atent create, ambalate ca astfel de acțiuni AI, ai nevoie de flexibilitate pentru a discuta în continuare rezultatele cu AI-ul. Astfel, am adăugat suport pentru crearea de acțiuni AI personalizate, specifice nevoilor tale. Aceste acțiuni AI, bazate pe prompturi ajustate de experții tăi (sau de ai noștri), continuă să fie utile pentru cazuri de utilizare precise și pentru persoanele care abia încep să folosească instrumente AI.

source: In time, we also started to explore and expand the capabilities of using chat to converse with the AI, attach all sorts of file types (<filepath class="+ topic/ph sw-d/filepath ">PDF</filepath>, <filepath class="+ topic/ph sw-d/filepath ">Word</filepath>, <filepath class="+ topic/ph sw-d/filepath ">Markdown</filepath>, images) to <b class="+ topic/ph hi-d/b ">create documentation drafts</b>, <b class="+ topic/ph hi-d/b ">explore</b>, and <b class="+ topic/ph hi-d/b ">make changes</b> in the current project.
ro: În timp, am început să explorăm și să extindem capabilitățile de a folosi chat-ul pentru a conversa cu AI-ul, de a atașa tot felul de tipuri de fișiere (<filepath class="+ topic/ph sw-d/filepath ">PDF</filepath>, <filepath class="+ topic/ph sw-d/filepath ">Word</filepath>, <filepath class="+ topic/ph sw-d/filepath ">Markdown</filepath>, imagini) pentru a <b class="+ topic/ph hi-d/b ">crea schițe de documentație</b>, a <b class="+ topic/ph hi-d/b ">explora</b> și a <b class="+ topic/ph hi-d/b ">efectua modificări</b> în proiectul curent.

source: The chat view in any <b class="+ topic/ph hi-d/b ">AI Assistant</b> application like <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> is the new <uicontrol class="+ topic/ph ui-d/uicontrol ">console</uicontrol>; you use it to <b class="+ topic/ph hi-d/b ">direct</b> the AI, <b class="+ topic/ph hi-d/b ">affect changes</b>, <b class="+ topic/ph hi-d/b ">preview</b> them, and refine until you have a working draft. You remain in control of a <b class="+ topic/ph hi-d/b ">powerful and imperfect</b> tool. As before, in the past, computers have moved writing and coding to a higher level of abstraction.
ro: Vizualizarea de chat din orice aplicație <b class="+ topic/ph hi-d/b ">AI Assistant</b>, precum <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol>, este noua <uicontrol class="+ topic/ph ui-d/uicontrol ">consolă</uicontrol>; o folosești pentru a <b class="+ topic/ph hi-d/b ">dirija</b> AI-ul, a <b class="+ topic/ph hi-d/b ">produce modificări</b>, a le <b class="+ topic/ph hi-d/b ">previzualiza</b> și a rafina până obții o schiță funcțională. Rămâi în controlul unui instrument <b class="+ topic/ph hi-d/b ">puternic și imperfect</b>. Așa cum, în trecut, computerele au ridicat scrierea și programarea la un nivel superior de abstractizare.

source: I would define the <b class="+ topic/ph hi-d/b ">Vibe Authoring</b> support in the <b class="+ topic/ph hi-d/b ">AI Positron</b> add-on as a feature that allows you to:
ro: Aș defini suportul <b class="+ topic/ph hi-d/b ">Vibe Authoring</b> din suplimentul <b class="+ topic/ph hi-d/b ">AI Positron</b> ca o funcționalitate care îți permite să:

source: Define a <b class="+ topic/ph hi-d/b ">project context prompt</b> that gives the AI models general information about your project, important style guide, terminology, and structure rules.
ro: Definești un <b class="+ topic/ph hi-d/b ">prompt de context de proiect</b> care oferă modelelor AI informații generale despre proiectul tău, reguli importante de stil, terminologie și structură.

source: <b class="+ topic/ph hi-d/b ">Chat</b> with the AI to <b class="+ topic/ph hi-d/b ">explore</b> the current project's contents or to <b class="+ topic/ph hi-d/b ">affect changes</b> in the project. All changes made by the AI can be <b class="+ topic/ph hi-d/b ">viewed</b> and <b class="+ topic/ph hi-d/b ">reverted</b>, if necessary.
ro: <b class="+ topic/ph hi-d/b ">Conversezi</b> cu AI-ul pentru a <b class="+ topic/ph hi-d/b ">explora</b> conținutul proiectului curent sau pentru a <b class="+ topic/ph hi-d/b ">efectua modificări</b> în proiect. Toate modificările realizate de AI pot fi <b class="+ topic/ph hi-d/b ">vizualizate</b> și <b class="+ topic/ph hi-d/b ">revenite</b>, dacă este necesar.

source: Connect <b class="+ topic/ph hi-d/b ">Model Context Protocol</b> servers to provide tools that integrate <b class="+ topic/ph hi-d/b ">AI Positron</b> with other data sources in your company (for example, ticketing system, issues list, etc.).
ro: Conectezi servere <b class="+ topic/ph hi-d/b ">Model Context Protocol</b> pentru a oferi instrumente care integrează <b class="+ topic/ph hi-d/b ">AI Positron</b> cu alte surse de date din compania ta (de exemplu, sistem de tichete, listă de probleme etc.).

source: Novice to Expert
ro: De la începător la expert

source: If one were to attempt to divide people into novices and experts, they would soon figure out that each of us is a <b class="+ topic/ph hi-d/b ">novice</b> in certain fields and an <b class="+ topic/ph hi-d/b ">expert</b> in others.
ro: Dacă cineva ar încerca să împartă oamenii în începători și experți, ar descoperi rapid că fiecare dintre noi este <b class="+ topic/ph hi-d/b ">începător</b> în anumite domenii și <b class="+ topic/ph hi-d/b ">expert</b> în altele.

source: As novices, we use out-of-the-box tools and frameworks with a minimum of customization to obtain poor results. We cannot explain either when the tool does not work or when it does. When we do not obtain quality content as novices, we blame the tools.
ro: Ca începători, folosim instrumente și framework-uri standard, cu o personalizare minimă, pentru a obține rezultate slabe. Nu putem explica nici când instrumentul nu funcționează, nici când funcționează. Când nu obținem conținut de calitate ca începători, dăm vina pe instrumente.

source: In time, by <b class="+ topic/ph hi-d/b ">reading</b>, <b class="+ topic/ph hi-d/b ">writing</b>, and <b class="+ topic/ph hi-d/b ">making mistakes</b>, we evolve to understand the tools and frameworks we use. Taking some time to understand these tools and to customize them gives us better and more consistent results.
ro: În timp, prin <b class="+ topic/ph hi-d/b ">lectură</b>, <b class="+ topic/ph hi-d/b ">scriere</b> și <b class="+ topic/ph hi-d/b ">greșeli</b>, evoluăm pentru a înțelege instrumentele și framework-urile pe care le folosim. Acordând timp pentru a le înțelege și a le personaliza, obținem rezultate mai bune și mai consistente.

source: This article is an attempt to give you a better understanding of how the <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> add-on works and how it can be customized to maximize the quality of your vibe authoring interactions.
ro: Acest articol este o încercare de a vă oferi o mai bună înțelegere a modului în care funcționează suplimentul <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> <uicontrol class="+ topic/ph ui-d/uicontrol ">AI Positron</uicontrol> și cum poate fi personalizat pentru a maximiza calitatea interacțiunilor de tip vibe authoring.

source: I am not of the opinion that we must consider using AI tools for all of our daily work; our brains need the effort and work we put into <b class="+ topic/ph hi-d/b ">writing</b> to better understand the task at hand. There are still many activities that can be accomplished more quickly and with sufficient quality (generating drafts, improving content quality) by using AI tools in a controlled manner.
ro: Nu consider că trebuie să folosim instrumente AI pentru toate activitățile zilnice; creierul nostru are nevoie de efortul și munca pe care le depunem în <b class="+ topic/ph hi-d/b ">scriere</b> pentru a înțelege mai bine sarcina de rezolvat. Totuși, există multe activități care pot fi realizate mai rapid și cu o calitate suficientă (generarea de schițe, îmbunătățirea calității conținutului) folosind instrumente AI într-un mod controlat.

source: Use a Version Control System
ro: Folosiți un sistem de control al versiunilor

source: Sometimes, you need to <b class="+ topic/ph hi-d/b ">view</b> and <b class="+ topic/ph hi-d/b ">revert changes</b> made by the <b class="+ topic/ph hi-d/b ">AI</b>, to keep a <b class="+ topic/ph hi-d/b ">history</b> of past changes in your project. You also need to <b class="+ topic/ph hi-d/b ">collaboratively</b> work with other <b class="+ topic/ph hi-d/b ">people</b> or with AI <b class="+ topic/ph hi-d/b ">agents</b>, create separate <b class="+ topic/ph hi-d/b ">branches</b> for working on features, keep your content <b class="+ topic/ph hi-d/b ">secure</b>, and eventually <b class="+ topic/ph hi-d/b ">publish</b> it.
ro: Uneori, este nevoie să <b class="+ topic/ph hi-d/b ">vizualizați</b> și să <b class="+ topic/ph hi-d/b ">reveniți la modificările</b> realizate de <b class="+ topic/ph hi-d/b ">AI</b>, pentru a păstra un <b class="+ topic/ph hi-d/b ">istoric</b> al modificărilor anterioare din proiect. De asemenea, trebuie să <b class="+ topic/ph hi-d/b ">colaborați</b> cu alți <b class="+ topic/ph hi-d/b ">oameni</b> sau cu <b class="+ topic/ph hi-d/b ">agenți</b> AI, să creați <b class="+ topic/ph hi-d/b ">ramuri</b> separate pentru dezvoltarea de funcționalități, să vă păstrați conținutul <b class="+ topic/ph hi-d/b ">sigur</b> și, în final, să îl <b class="+ topic/ph hi-d/b ">publicați</b>.

source: So a version control system for your project, like <b class="+ topic/ph hi-d/b ">Git</b> or a commercial <b class="+ topic/ph hi-d/b ">CCMS</b>, is a <b class="+ topic/ph hi-d/b ">must</b>.
ro: Prin urmare, un sistem de control al versiunilor pentru proiectul dumneavoastră, precum <b class="+ topic/ph hi-d/b ">Git</b> sau un <b class="+ topic/ph hi-d/b ">CCMS</b> comercial, este <b class="+ topic/ph hi-d/b ">obligatoriu</b>.

source: <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph>'s free <b class="+ topic/ph hi-d/b ">Git client add-on</b> is a great tool that gives technical documentation writers just about every feature needed to work with Git projects: support to pull, make changes, preview them, push, a useful <b class="+ topic/ph hi-d/b ">History</b> side view, switch branches, and stash changes.
ro: Suplimentul gratuit <b class="+ topic/ph hi-d/b ">Git client add-on</b> din <ph keyref="oxygen" status="removeContent" class="- topic/ph "><keyword class="- topic/keyword ">Oxygen XML Editor</keyword></ph> este un instrument excelent care oferă creatorilor de documentație tehnică aproape toate funcționalitățile necesare pentru a lucra cu proiecte Git: suport pentru pull, efectuarea de modificări, previzualizarea acestora, push, o vizualizare laterală utilă <b class="+ topic/ph hi-d/b ">History</b>, schimbarea ramurilor și stocarea temporară a modificărilor.

source: Using Git For Technical Writing
ro: Utilizarea Git pentru redactare tehnică

source: Set up Your Project Context Prompt
ro: Configurați promptul de context al proiectului

source: LLM Models have a <b class="+ topic/ph hi-d/b ">limited context window</b> and start out not knowing anything about the intricacies of your current documentation project. They can use tools to explore your project's structure, but it's more efficient to create a <b class="+ topic/ph hi-d/b ">project context prompt</b>, which becomes part of each invoked AI action and chat conversation.
ro: Modelele LLM au o <b class="+ topic/ph hi-d/b ">fereastră de context limitată</b> și, inițial, nu cunosc nimic despre particularitățile proiectului dumneavoastră de documentație. Ele pot folosi instrumente pentru a explora structura proiectului, dar este mai eficient să creați un <b class="+ topic/ph hi-d/b ">prompt de context de proiect</b>, care devine parte a fiecărei acțiuni AI invocate și a fiecărei conversații de chat.
