Repository: oxygenxml/blog
Catalog: translations/xliff/1st translation/translated/oxygen_xml_blog_*.ditamap.xlf
Languages: ro

source: <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/creating_custom_ai_actions.html" scope="external" class="- topic/xref " format="html">Custom actions</xref> can also be created and used. The same <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Custom%20Actions" scope="external" class="- topic/xref " format="html">AI Positron Samples Playground</xref> contains some sample custom actions. Some usage examples can be found in the <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Schematron%20and%20Quick%20Fixes" scope="external" class="- topic/xref " format="html">samples playground</xref>.
ro: <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/creating_custom_ai_actions.html" scope="external" class="- topic/xref " format="html">Acțiuni personalizate</xref> pot fi de asemenea create și utilizate. Același <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Custom%20Actions" scope="external" class="- topic/xref " format="html">AI Positron Samples Playground</xref> conține câteva exemple de acțiuni personalizate. Câteva exemple de utilizare pot fi găsite în <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/Schematron%20and%20Quick%20Fixes" scope="external" class="- topic/xref " format="html">samples playground</xref>.

source: Visual Image Recognition (Vision)
ro: Recunoaștere vizuală a imaginilor (Vision)

source: The pre-defined <b class="+ topic/ph hi-d/b ">Generate Documentation Draft</b> and <b class="+ topic/ph hi-d/b ">Update Content Based on Images</b> actions allow using the AI to create or update content depending on existing images from your user's manual. You can also attach images in the <b class="+ topic/ph hi-d/b ">Chat</b> panel.
ro: Acțiunile predefinite <b class="+ topic/ph hi-d/b ">Generate Documentation Draft</b> și <b class="+ topic/ph hi-d/b ">Update Content Based on Images</b> permit utilizarea AI pentru a crea sau actualiza conținut în funcție de imaginile existente din manualul utilizatorului. De asemenea, puteți atașa imagini în panoul <b class="+ topic/ph hi-d/b ">Chat</b>.

source: Batch Processing
ro: Procesare în lot

source: The <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__ai_refactoring" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">AI Positron Refactoring</b></xref> actions added to the <b class="+ topic/ph hi-d/b ">Project</b> and <b class="+ topic/ph hi-d/b ">DITA Maps Manager</b> views are a way to run actions on multiple files. For example, you could use the predefined <uicontrol class="+ topic/ph ui-d/uicontrol ">Translate to</uicontrol> action to translate multiple DITA topics into a certain language or apply the <uicontrol class="+ topic/ph ui-d/uicontrol ">Correct Grammar</uicontrol> or <uicontrol class="+ topic/ph ui-d/uicontrol ">Improve Readability</uicontrol> actions on multiple resources.
ro: Acțiunile <xref href="https://www.oxygenxml.com/doc/ug-positron-desktop/ai/functionality_features.html#functionality_features__ai_refactoring" scope="external" class="- topic/xref " format="html"><b class="+ topic/ph hi-d/b ">AI Positron Refactoring</b></xref> adăugate în vizualizările <b class="+ topic/ph hi-d/b ">Project</b> și <b class="+ topic/ph hi-d/b ">DITA Maps Manager</b> reprezintă o modalitate de a rula acțiuni pe mai multe fișiere. De exemplu, puteți folosi acțiunea predefinită <uicontrol class="+ topic/ph ui-d/uicontrol ">Translate to</uicontrol> pentru a traduce mai multe topicuri DITA într-o anumită limbă sau puteți aplica acțiunile <uicontrol class="+ topic/ph ui-d/uicontrol ">Correct Grammar</uicontrol> sau <uicontrol class="+ topic/ph ui-d/uicontrol ">Improve Readability</uicontrol> pe mai multe resurse.

source: In addition, <b class="+ topic/ph hi-d/b ">XML Refactoring</b> actions based on XSLT or XQuery can use the XPath extension functions added by the add-on to perform batch changes in XML documents. Some examples can be found in the <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/XML%20Refactoring" scope="external" class="- topic/xref " format="html">samples playground</xref>.
ro: În plus, acțiunile <b class="+ topic/ph hi-d/b ">XML Refactoring</b> bazate pe XSLT sau XQuery pot folosi funcțiile de extensie XPath adăugate de supliment pentru a efectua modificări în lot în documentele XML. Câteva exemple pot fi găsite în <xref href="https://github.com/oxygenxml-incubator/ai-positron-assistant-samples/tree/main/XML%20Refactoring" scope="external" class="- topic/xref " format="html">samples playground</xref>.

source: Useful Links
ro: Linkuri utile

source: Blog Post About AI Positron Add-on By Tom Johnson
ro: Articol pe blog despre AI Positron Add-on de Tom Johnson

source: Webinar: AI as a Tool for Technical Content Creation
ro: Webinar: AI ca instrument pentru crearea de conținut tehnic

source: Webinar: Leveraging the Power of AI and Schematron for Content Verification and Correction
ro: Webinar: Valorificarea puterii AI și Schematron pentru verificarea și corectarea conținutului

source: Meetup Recording: Oxygen AI Positron Assistant - Integrating AI Across Oxygen Tools
ro: Înregistrare meetup: Oxygen AI Positron Assistant - Integrarea AI în toate instrumentele Oxygen

source: AI XPath Extension Functions in Oxygen XML Editor
ro: Funcții de extensie XPath AI în Oxygen XML Editor

source: The integration of <b class="+ topic/ph hi-d/b ">AI-driven XPath extension functions</b> in Oxygen XML Editor represents a major step forward in the XML content lifecycle by introducing intelligent automation. These features improve Schematron, XSLT, and XQuery workflows by enabling natural language-driven rephrasing, validation, and custom AI-powered actions directly within your schemas and stylesheets. This post provides an overview of the key functions, practical examples, and configuration options to help you use these AI capabilities effectively, safely, and at scale.
ro: Integrarea <b class="+ topic/ph hi-d/b ">funcțiilor de extensie XPath bazate pe AI</b> în Oxygen XML Editor reprezintă un pas major înainte în ciclul de viață al conținutului XML, prin introducerea automatizării inteligente. Aceste funcționalități îmbunătățesc fluxurile de lucru Schematron, XSLT și XQuery, permițând reformularea, validarea și acțiunile personalizate alimentate de AI, direct în schemele și foile de stil ale dumneavoastră, folosind limbaj natural. Acest articol oferă o prezentare generală a funcțiilor cheie, exemple practice și opțiuni de configurare pentru a vă ajuta să utilizați aceste capabilități AI eficient, sigur și la scară largă.

source: Meet the AI XPath Extension Functions
ro: Faceți cunoștință cu funcțiile de extensie XPath AI

source: The Oxygen AI Positron add-on introduces three primary functions (namespace <codeph class="+ topic/ph pr-d/codeph ">http://www.oxygenxml.com/ai/function</codeph>) that can be used directly in Schematron, XSLT, XQuery, XProc, and XPath expressions:
ro: Suplimentul Oxygen AI Positron introduce trei funcții principale (namespace <codeph class="+ topic/ph pr-d/codeph ">http://www.oxygenxml.com/ai/function</codeph>) care pot fi utilizate direct în expresii Schematron, XSLT, XQuery, XProc și XPath:

source: <b class="+ topic/ph hi-d/b ">Purpose:</b> Transforms or rephrases content using AI, guided by a system prompt and user-provided input.
ro: <b class="+ topic/ph hi-d/b ">Scop:</b> Transformă sau reformulează conținutul folosind AI, ghidat de un prompt de sistem și de inputul furnizat de utilizator.

source: Parameters:
ro: Parametri:

source: <b class="+ topic/ph hi-d/b ">system:</b> Context or rule (e.g., “Follow company style guidelines”).
ro: <b class="+ topic/ph hi-d/b ">system:</b> Context sau regulă (ex.: „Respectă ghidul de stil al companiei”).

source: <b class="+ topic/ph hi-d/b ">user:</b> The input text to be transformed.
ro: <b class="+ topic/ph hi-d/b ">user:</b> Textul de intrare care trebuie transformat.

source: <b class="+ topic/ph hi-d/b ">assistant:</b> (Optional, repeatable) Previous AI responses for context in multi-stage operations.
ro: <b class="+ topic/ph hi-d/b ">assistant:</b> (Opțional, repetabil) Răspunsuri AI anterioare pentru context în operațiuni multi-etapă.

source: <b class="+ topic/ph hi-d/b ">Returns:</b> AI-generated, transformed string.
ro: <b class="+ topic/ph hi-d/b ">Returnează:</b> Șir generat de AI, transformat.

source: Sample Use in Schematron:
ro: Exemplu de utilizare în Schematron:

source: <sqf:replace match="text()" select="ai:transform-content('Reformulate phrase to be less than 50 words', .)"/>
ro: <sqf:replace match="text()" select="ai:transform-content('Reformulează fraza să aibă mai puțin de 50 de cuvinte', .)"/>

source: <b class="+ topic/ph hi-d/b ">Purpose:</b> Validates content using natural language prompts, returning a Boolean result.
ro: <b class="+ topic/ph hi-d/b ">Scop:</b> Validează conținutul folosind prompturi în limbaj natural, returnând un rezultat Boolean.

source: <b class="+ topic/ph hi-d/b ">Parameters:</b> Same as above.
ro: <b class="+ topic/ph hi-d/b ">Parametri:</b> La fel ca mai sus.

source: <b class="+ topic/ph hi-d/b ">Returns:</b> Boolean (true/false), ideal for driving Schematron assertions.
ro: <b class="+ topic/ph hi-d/b ">Returnează:</b> Boolean (adevărat/fals), ideal pentru a conduce aserțiuni Schematron.

source: Sample Use in Schematron:
ro: Exemplu de utilizare în Schematron:

source: <sch:report test="ai:verify-content('Does the following content have passive voice?', .)" sqf:fix="rephrase"> The phrase uses passive voice. </sch:report>
ro: <sch:report test="ai:verify-content('Conține următorul conținut diateza pasivă?', .)" sqf:fix="rephrase"> Fraza folosește diateza pasivă. </sch:report>

source: <b class="+ topic/ph hi-d/b ">Purpose:</b> Executes a pre-configured AI action with additional context or prompts on a given content block.
ro: <b class="+ topic/ph hi-d/b ">Scop:</b> Execută o acțiune AI preconfigurată cu context suplimentar sau prompturi pe un bloc de conținut dat.

source: Parameters:
ro: Parametri:

source: <b class="+ topic/ph hi-d/b ">actionId:</b> ID of the registered AI action.
ro: <b class="+ topic/ph hi-d/b ">actionId:</b> ID-ul acțiunii AI înregistrate.

source: <b class="+ topic/ph hi-d/b ">extraPrompt:</b> Additional context for the action.
ro: <b class="+ topic/ph hi-d/b ">extraPrompt:</b> Context suplimentar pentru acțiune.

source: <b class="+ topic/ph hi-d/b ">content:</b> XML node or string to process.
ro: <b class="+ topic/ph hi-d/b ">content:</b> Nod XML sau șir de procesat.

source: <b class="+ topic/ph hi-d/b ">Returns:</b> The transformed (or analyzed) string.
ro: <b class="+ topic/ph hi-d/b ">Returnează:</b> Șirul transformat (sau analizat).

source: Sample Use in Schematron:
ro: Exemplu de utilizare în Schematron:

source: <sqf:replace match="text()" select="ai:invoke-action('Reformulate phrase to be less than 50 words', .)"/>
ro: <sqf:replace match="text()" select="ai:invoke-action('Reformulează fraza să aibă mai puțin de 50 de cuvinte', .)"/>

source: Real-World Example: Optimizing Short Descriptions
ro: Exemplu din practică: Optimizarea descrierilor scurte

source: Validation & Refactoring in One Step:
ro: Validare și refactorizare într-un singur pas:

source: This example demonstrates a rule that validates if a short description exceeds 50 words and provides an automated fix to rephrase it to meet the word limit. The rule uses Schematron and Smart Fix (SQF) to ensure concise and effective short descriptions.
ro: Acest exemplu demonstrează o regulă care validează dacă o descriere scurtă depășește 50 de cuvinte și oferă o corecție automată pentru a o reformula astfel încât să respecte limita de cuvinte. Regula folosește Schematron și Smart Fix (SQF) pentru a asigura descrieri scurte concise și eficiente.

source: <sch:rule context="shortdesc"> <sch:report test="count(tokenize(.,'\s+')) > 50" sqf:fix="rephrase"> The phrase must contain less than 50 words. </sch:report> <sqf:fix id="rephrase"> <sqf:description> <sqf:title>Rephrase phrase to be less than 50 words</sqf:title> </sqf:description> <sqf:replace match="text()" select="ai:transform-content('Reformulate phrase to be less than 50 words', .)"/> </sqf:fix> </sch:rule>
ro: <sch:rule context="shortdesc"> <sch:report test="count(tokenize(.,'\s+')) > 50" sqf:fix="rephrase"> Fraza trebuie să conțină mai puțin de 50 de cuvinte. </sch:report> <sqf:fix id="rephrase"> <sqf:description> <sqf:title>Reformulează fraza să aibă mai puțin de 50 de cuvinte</sqf:title> </sqf:description> <sqf:replace match="text()" select="ai:transform-content('Reformulează fraza să aibă mai puțin de 50 de cuvinte', .)"/> </sqf:fix> </sch:rule>

source: Active Voice Checker:
ro: Verificator de voce activă:

source: This example illustrates a rule that checks if a short description contains passive voice and provides an automated fix to rephrase it into active voice. The rule leverages AI-based content verification and transformation to enhance the clarity and impact of the text.
ro: Acest exemplu ilustrează o regulă care verifică dacă o descriere scurtă conține diateza pasivă și oferă o corecție automată pentru a o reformula în diateza activă. Regula utilizează verificarea și transformarea conținutului bazate pe AI pentru a spori claritatea și impactul textului.

source: <sch:rule context="shortdesc"> <sch:report test="ai:verify-content('Does the following content have passive voice?', .)" sqf:fix="rephrase">The phrase uses passive voice.</sch:report> <sqf:fix id="rephrase"> <sqf:description> <sqf:title>Rephrase text to be active voice</sqf:title> </sqf:description> <sqf:replace match="text()" select="ai:transform-content('Rephrase text to be active voice', .)"/> </sqf:fix> </sch:rule>
ro: <sch:rule context="shortdesc"> <sch:report test="ai:verify-content('Conține următorul conținut diateza pasivă?', .)" sqf:fix="rephrase">Fraza folosește diateza pasivă.</sch:report> <sqf:fix id="rephrase"> <sqf:description> <sqf:title>Reformulează textul în diateza activă</sqf:title> </sqf:description> <sqf:replace match="text()" select="ai:transform-content('Reformulează textul în diateza activă', .)"/> </sqf:fix> </sch:rule>

source: Refactor Content Using XSL and AI
ro: Refactorizarea conținutului folosind XSL și AI

source: The combination of AI and XSLT allows for dynamic and intelligent content transformation. By utilizing AI-driven XPath extension functions, you can automate tasks such as generating alternate text for images, ensuring accessibility and compliance with minimal manual intervention.
ro: Combinarea AI cu XSLT permite transformarea dinamică și inteligentă a conținutului. Utilizând funcțiile de extensie XPath bazate pe AI, puteți automatiza sarcini precum generarea textului alternativ pentru imagini, asigurând accesibilitatea și conformitatea cu un efort manual minim.

source: Example: Generate Alternate Text for Images
ro: Exemplu: Generarea textului alternativ pentru imagini

source: The following XSLT template generates alternate text for images with a `keyref` attribute but without an `alt` attribute. The template employs the `ai:transform-content` function to create a concise alternate text description for the image. The generated alternate text is then added to the `alt` element within the copied image node. This method ensures that all images that lack alternate text are enhanced with meaningful descriptions, improving both accessibility and usability.
ro: Următorul șablon XSLT generează text alternativ pentru imaginile care au atributul `keyref`, dar nu au atributul `alt`. Șablonul utilizează funcția `ai:transform-content` pentru a crea o descriere alternativă concisă pentru imagine. Textul alternativ generat este apoi adăugat în elementul `alt` din cadrul nodului imagine copiat. Această metodă asigură că toate imaginile fără text alternativ sunt completate cu descrieri relevante, îmbunătățind atât accesibilitatea, cât și utilizabilitatea.

source: <xsl:template match="image[@keyref][not(alt)]"> <xsl:copy> <xsl:apply-templates select="@*"/> <alt> <xsl:value-of select=" ai:transform-content( 'Create a short alternate text description for this image:', concat('{attach(', resolve-uri(@href, base-uri()), ')}'))"/> </alt> <xsl:apply-templates select="node()"/> </xsl:copy> </xsl:template>
ro: <xsl:template match="image[@keyref][not(alt)]"> <xsl:copy> <xsl:apply-templates select="@*"/> <alt> <xsl:value-of select=" ai:transform-content( 'Creează o scurtă descriere alternativă pentru această imagine:', concat('{attach(', resolve-uri(@href, base-uri()), ')}'))"/> </alt> <xsl:apply-templates select="node()"/> </xsl:copy> </xsl:template>

source: This example demonstrates how AI can dynamically generate meaningful alternate text for images, ensuring your content is accessible and enriched with metadata.
ro: Acest exemplu demonstrează cum AI poate genera dinamic texte alternative relevante pentru imagini, asigurând că materialul dumneavoastră este accesibil și îmbogățit cu metadate.

source: Example: Language Translation and Validation
ro: Exemplu: Traducere și validare lingvistică

source: The following XSLT template showcases how AI-driven XPath functions can be used for multi-language translation and validation. In this example, content is translated into French in three variants, then translated back into English. The English translations are compared with the original content to determine the most accurate French translation:
ro: Următorul șablon XSLT arată cum funcțiile XPath bazate pe AI pot fi folosite pentru traducere și validare multilingvă. În acest exemplu, conținutul este tradus în franceză în trei variante, apoi tradus înapoi în engleză. Traducerile în engleză sunt comparate cu conținutul original pentru a determina cea mai precisă traducere în franceză:

source: <xsl:template match="text()"> <xsl:variable name="agentFrench" select="ai:transform-content('Translate to French in 3 variants ', .)"/> <xsl:variable name="agentEnglish" select="ai:transform-content('Translate content from French to English ', $agentFrench)"/> <xsl:value-of select="ai:transform-content( 'Compare the English translation with original content and use the correct French translation. ', 'Translate to french in 3 variants ', $agentFrench, 'Translate from french to english ', $agentEnglish,.)"/> </xsl:template>
ro: <xsl:template match="text()"> <xsl:variable name="agentFrench" select="ai:transform-content('Tradu în franceză în 3 variante ', .)"/> <xsl:variable name="agentEnglish" select="ai:transform-content('Tradu conținutul din franceză în engleză ', $agentFrench)"/> <xsl:value-of select="ai:transform-content( 'Compară traducerea în engleză cu conținutul original și folosește traducerea corectă în franceză. ', 'Tradu în franceză în 3 variante ', $agentFrench, 'Tradu din franceză în engleză ', $agentEnglish,.)"/> </xsl:template>

source: This method ensures that the final French translation is both accurate and contextually appropriate, leveraging AI's capabilities to process and validate multilingual content effectively.
ro: Această metodă asigură că traducerea finală în franceză este atât precisă, cât și adecvată contextului, valorificând capabilitățile AI pentru a procesa și valida eficient conținut multilingv.

source: Configuration Options: Balancing Power and Performance
ro: Opțiuni de configurare: echilibrarea puterii și performanței

source: Oxygen provides several options to customize AI function behavior according to your project’s requirements:
ro: Oxygen oferă mai multe opțiuni pentru a personaliza comportamentul funcțiilor AI în funcție de cerințele proiectului dumneavoastră:

source: Enable XPath Functions
ro: Activează funcțiile XPath

source: <b class="+ topic/ph hi-d/b ">Purpose:</b> Activates AI-driven XPath functions for Schematron/XSLT validation and transformation.
ro: <b class="+ topic/ph hi-d/b ">Scop:</b> Activează funcțiile XPath bazate pe AI pentru validare și transformare Schematron/XSLT.

source: <b class="+ topic/ph hi-d/b ">Default:</b> Enabled.
ro: <b class="+ topic/ph hi-d/b ">Implicit:</b> Activat.

source: Cache Responses and Reuse Them for Identical Prompts
ro: Cachează răspunsurile și reutilizează-le pentru prompturi identice

source: <b class="+ topic/ph hi-d/b ">Purpose:</b> Minimizes redundant API calls and accelerates validation/transformation by caching AI responses for identical inputs.
ro: <b class="+ topic/ph hi-d/b ">Scop:</b> Minimizează apelurile API redundante și accelerează validarea/transformarea prin cache-ul răspunsurilor AI pentru inputuri identice.

source: <b class="+ topic/ph hi-d/b ">Default:</b> Enabled.
ro: <b class="+ topic/ph hi-d/b ">Implicit:</b> Activat.

source: <b class="+ topic/ph hi-d/b ">Management:</b> A "Clear cache" button allows you to instantly delete all stored responses.
ro: <b class="+ topic/ph hi-d/b ">Administrare:</b> Un buton „Șterge cache-ul” vă permite să ștergeți instantaneu toate răspunsurile stocate.

source: Cache Size
ro: Dimensiune cache

source: <b class="+ topic/ph hi-d/b ">Purpose:</b> Sets an upper limit on the number of responses that can be cached, preventing excessive memory/resource usage.
ro: <b class="+ topic/ph hi-d/b ">Scop:</b> Stabilește o limită superioară pentru numărul de răspunsuri care pot fi stocate în cache, prevenind utilizarea excesivă a memoriei/resurselor.

source: Notify Me When the Number of Requests Exceeds…
ro: Notifică-mă când numărul de cereri depășește…

source: <b class="+ topic/ph hi-d/b ">Purpose:</b> Provides a safeguard for large-scale operations.
ro: <b class="+ topic/ph hi-d/b ">Scop:</b> Oferă o măsură de siguranță pentru operațiuni la scară mare.

source: <b class="+ topic/ph hi-d/b ">Behavior:</b> If the specified threshold of AI requests is exceeded, Oxygen displays a confirmation dialog box. You can choose to stop using the XPath AI functions if the volume seems excessive.
ro: <b class="+ topic/ph hi-d/b ">Comportament:</b> Dacă pragul specificat de cereri AI este depășit, Oxygen afișează o casetă de dialog de confirmare. Puteți alege să opriți utilizarea funcțiilor XPath AI dacă volumul vi se pare excesiv.

source: Summary: Why Use AI XPath Functions in Oxygen?
ro: Rezumat: De ce să folosiți funcțiile XPath AI în Oxygen?

source: <b class="+ topic/ph hi-d/b ">Express style, validation, and transformation in natural language</b>, eliminating the need for numerous rigid rules.
ro: <b class="+ topic/ph hi-d/b ">Exprimați stilul, validarea și transformarea în limbaj natural</b>, eliminând nevoia pentru numeroase reguli rigide.

source: <b class="+ topic/ph hi-d/b ">Automate repetitive editorial tasks</b> (e.g., word count, voice, grammar) and provide AI-powered fixes directly in authoring tools.
ro: <b class="+ topic/ph hi-d/b ">Automatizați sarcinile editoriale repetitive</b> (ex.: numărare cuvinte, voce, gramatică) și oferiți corecții AI direct în instrumentele de editare.

source: <b class="+ topic/ph hi-d/b ">Control resource usage, compliance, and performance</b> through detailed configuration options.
ro: <b class="+ topic/ph hi-d/b ">Controlați utilizarea resurselor, conformitatea și performanța</b> prin opțiuni detaliate de configurare.

source: These features are revolutionizing the XML content pipeline, enabling smart, standards-compliant authoring and validation to be effortless and secure.
ro: Aceste funcționalități revoluționează fluxul de conținut XML, permițând o editare și validare inteligentă, conformă cu standardele, într-un mod facil și sigur.
